/* automatically generated by rust-bindgen 0.60.1 */

pub const LIBLEPT_MAJOR_VERSION: u32 = 1;
pub const LIBLEPT_MINOR_VERSION: u32 = 83;
pub const LIBLEPT_PATCH_VERSION: u32 = 0;
pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 36;

pub const HAVE_LIBZ: u32 = 1;
pub const HAVE_LIBGIF: u32 = 0;
pub const HAVE_LIBUNGIF: u32 = 0;
pub const HAVE_LIBWEBP: u32 = 0;
pub const HAVE_LIBWEBP_ANIM: u32 = 0;
pub const HAVE_LIBJP2K: u32 = 0;
pub const USE_BMPIO: u32 = 1;
pub const USE_PNMIO: u32 = 1;
pub const USE_JP2KHEADER: u32 = 1;
pub const USE_PDFIO: u32 = 1;
pub const USE_PSIO: u32 = 1;
pub const HAVE_FMEMOPEN: u32 = 1;
pub const HAVE_FSTATAT: u32 = 0;
pub const HAVE_DIRFD: u32 = 0;
pub const UNDEF: i32 = -1;
pub const TRUE: u32 = 1;
pub const FALSE: u32 = 0;
pub const USE_INLINE_ACCESSORS: u32 = 1;
pub const DEWARP_VERSION_NUMBER: u32 = 4;
pub const GPLOT_VERSION_NUMBER: u32 = 1;
pub const NUM_GPLOT_STYLES: u32 = 5;
pub const NUM_GPLOT_OUTPUTS: u32 = 6;
pub const JB_TEMPLATE_EXT: &[u8; 15usize] = b".templates.png\0";
pub const JB_DATA_EXT: &[u8; 6usize] = b".data\0";
pub const SEL_VERSION_NUMBER: u32 = 1;
pub const KERNEL_VERSION_NUMBER: u32 = 2;
pub const PIX_SRC: u32 = 12;
pub const PIX_DST: u32 = 10;
pub const PIX_CLR: u32 = 0;
pub const PIX_SET: u32 = 15;
pub const PIX_PAINT: u32 = 14;
pub const PIX_MASK: u32 = 8;
pub const PIX_XOR: u32 = 6;
pub const RECOG_VERSION_NUMBER: u32 = 2;
pub type size_t = ::std::os::raw::c_ulong;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__fsid_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    fn test_field___wch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wch)
            )
        );
    }
    test_field___wch();
    fn test_field___wchb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wchb)
            )
        );
    }
    test_field___wchb();
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    fn test_field___count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__count)
            )
        );
    }
    test_field___count();
    fn test_field___value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__mbstate_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__value)
            )
        );
    }
    test_field___value();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    fn test_field___pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__pos)
            )
        );
    }
    test_field___pos();
    fn test_field___state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__state)
            )
        );
    }
    test_field___state();
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    fn test_field___pos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__pos)
            )
        );
    }
    test_field___pos();
    fn test_field___state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_G_fpos64_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__state)
            )
        );
    }
    test_field___state();
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    fn test_field__flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
    }
    test_field__flags();
    fn test_field__IO_read_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
    }
    test_field__IO_read_ptr();
    fn test_field__IO_read_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
    }
    test_field__IO_read_end();
    fn test_field__IO_read_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
    }
    test_field__IO_read_base();
    fn test_field__IO_write_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
    }
    test_field__IO_write_base();
    fn test_field__IO_write_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
    }
    test_field__IO_write_ptr();
    fn test_field__IO_write_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
    }
    test_field__IO_write_end();
    fn test_field__IO_buf_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
    }
    test_field__IO_buf_base();
    fn test_field__IO_buf_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
    }
    test_field__IO_buf_end();
    fn test_field__IO_save_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
    }
    test_field__IO_save_base();
    fn test_field__IO_backup_base() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
    }
    test_field__IO_backup_base();
    fn test_field__IO_save_end() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
    }
    test_field__IO_save_end();
    fn test_field__markers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
    }
    test_field__markers();
    fn test_field__chain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
    }
    test_field__chain();
    fn test_field__fileno() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
    }
    test_field__fileno();
    fn test_field__flags2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
    }
    test_field__flags2();
    fn test_field__old_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
    }
    test_field__old_offset();
    fn test_field__cur_column() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
    }
    test_field__cur_column();
    fn test_field__vtable_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize
            },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
    }
    test_field__vtable_offset();
    fn test_field__shortbuf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize
            },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
    }
    test_field__shortbuf();
    fn test_field__lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
    }
    test_field__lock();
    fn test_field__offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
    }
    test_field__offset();
    fn test_field__codecvt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
    }
    test_field__codecvt();
    fn test_field__wide_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
    }
    test_field__wide_data();
    fn test_field__freeres_list() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
    }
    test_field__freeres_list();
    fn test_field__freeres_buf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
    }
    test_field__freeres_buf();
    fn test_field___pad5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
    }
    test_field___pad5();
    fn test_field__mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
    }
    test_field__mode();
    fn test_field__unused2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_IO_FILE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    test_field__unused2();
}
pub type off_t = __off_t;
pub type ssize_t = __ssize_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<div_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(div_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<div_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(div_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<ldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<lldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<lldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__sigset_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sigset_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    fn test_field_tv_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timeval>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_sec)
            )
        );
    }
    test_field_tv_sec();
    fn test_field_tv_usec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timeval>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_usec)
            )
        );
    }
    test_field_tv_usec();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    fn test_field_tv_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timespec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timespec),
                "::",
                stringify!(tv_sec)
            )
        );
    }
    test_field_tv_sec();
    fn test_field_tv_nsec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<timespec>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timespec),
                "::",
                stringify!(tv_nsec)
            )
        );
    }
    test_field_tv_nsec();
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    fn test_field___fds_bits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<fd_set>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(fd_set),
                "::",
                stringify!(__fds_bits)
            )
        );
    }
    test_field___fds_bits();
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    fn test_field___low() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__atomic_wide_counter__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__atomic_wide_counter__bindgen_ty_1),
                "::",
                stringify!(__low)
            )
        );
    }
    test_field___low();
    fn test_field___high() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<__atomic_wide_counter__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__atomic_wide_counter__bindgen_ty_1),
                "::",
                stringify!(__high)
            )
        );
    }
    test_field___high();
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    fn test_field___value64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__atomic_wide_counter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__atomic_wide_counter),
                "::",
                stringify!(__value64)
            )
        );
    }
    test_field___value64();
    fn test_field___value32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__atomic_wide_counter>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__atomic_wide_counter),
                "::",
                stringify!(__value32)
            )
        );
    }
    test_field___value32();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    fn test_field___prev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__prev)
            )
        );
    }
    test_field___prev();
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_list>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_list),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    fn test_field___next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_internal_slist>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_internal_slist),
                "::",
                stringify!(__next)
            )
        );
    }
    test_field___next();
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    fn test_field___lock() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__lock)
            )
        );
    }
    test_field___lock();
    fn test_field___count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__count)
            )
        );
    }
    test_field___count();
    fn test_field___owner() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__owner)
            )
        );
    }
    test_field___owner();
    fn test_field___nusers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__nusers)
            )
        );
    }
    test_field___nusers();
    fn test_field___kind() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__kind)
            )
        );
    }
    test_field___kind();
    fn test_field___spins() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__spins)
            )
        );
    }
    test_field___spins();
    fn test_field___elision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize
            },
            22usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__elision)
            )
        );
    }
    test_field___elision();
    fn test_field___list() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_mutex_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_mutex_s),
                "::",
                stringify!(__list)
            )
        );
    }
    test_field___list();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    fn test_field___readers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__readers)
            )
        );
    }
    test_field___readers();
    fn test_field___writers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__writers)
            )
        );
    }
    test_field___writers();
    fn test_field___wrphase_futex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__wrphase_futex)
            )
        );
    }
    test_field___wrphase_futex();
    fn test_field___writers_futex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__writers_futex)
            )
        );
    }
    test_field___writers_futex();
    fn test_field___pad3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad3)
            )
        );
    }
    test_field___pad3();
    fn test_field___pad4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad4)
            )
        );
    }
    test_field___pad4();
    fn test_field___cur_writer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__cur_writer)
            )
        );
    }
    test_field___cur_writer();
    fn test_field___shared() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__shared)
            )
        );
    }
    test_field___shared();
    fn test_field___rwelision() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__rwelision)
            )
        );
    }
    test_field___rwelision();
    fn test_field___pad1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad1)
            )
        );
    }
    test_field___pad1();
    fn test_field___pad2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__pad2)
            )
        );
    }
    test_field___pad2();
    fn test_field___flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_rwlock_arch_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_rwlock_arch_t),
                "::",
                stringify!(__flags)
            )
        );
    }
    test_field___flags();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    fn test_field___wseq() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__wseq)
            )
        );
    }
    test_field___wseq();
    fn test_field___g1_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g1_start)
            )
        );
    }
    test_field___g1_start();
    fn test_field___g_refs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_refs)
            )
        );
    }
    test_field___g_refs();
    fn test_field___g_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_size)
            )
        );
    }
    test_field___g_size();
    fn test_field___g1_orig_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g1_orig_size)
            )
        );
    }
    test_field___g1_orig_size();
    fn test_field___wrefs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__wrefs)
            )
        );
    }
    test_field___wrefs();
    fn test_field___g_signals() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__pthread_cond_s>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(__pthread_cond_s),
                "::",
                stringify!(__g_signals)
            )
        );
    }
    test_field___g_signals();
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__once_flag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__once_flag),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutexattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutexattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutexattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_condattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_condattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_condattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_attr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_attr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_attr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_mutex_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_mutex_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_cond_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_cond_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    fn test_field___data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__data)
            )
        );
    }
    test_field___data();
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlock_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlock_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlockattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_rwlockattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_rwlockattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrier_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrier_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrier_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrier_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    fn test_field___size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrierattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrierattr_t),
                "::",
                stringify!(__size)
            )
        );
    }
    test_field___size();
    fn test_field___align() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<pthread_barrierattr_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(pthread_barrierattr_t),
                "::",
                stringify!(__align)
            )
        );
    }
    test_field___align();
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    fn test_field_fptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(fptr)
            )
        );
    }
    test_field_fptr();
    fn test_field_rptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rptr)
            )
        );
    }
    test_field_rptr();
    fn test_field_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(state)
            )
        );
    }
    test_field_state();
    fn test_field_rand_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_type)
            )
        );
    }
    test_field_rand_type();
    fn test_field_rand_deg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_deg)
            )
        );
    }
    test_field_rand_deg();
    fn test_field_rand_sep() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(rand_sep)
            )
        );
    }
    test_field_rand_sep();
    fn test_field_end_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<random_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(random_data),
                "::",
                stringify!(end_ptr)
            )
        );
    }
    test_field_end_ptr();
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    fn test_field___x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__x)
            )
        );
    }
    test_field___x();
    fn test_field___old_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__old_x)
            )
        );
    }
    test_field___old_x();
    fn test_field___c() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__c)
            )
        );
    }
    test_field___c();
    fn test_field___init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize
            },
            14usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__init)
            )
        );
    }
    test_field___init();
    fn test_field___a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<drand48_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(drand48_data),
                "::",
                stringify!(__a)
            )
        );
    }
    test_field___a();
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn arc4random() -> __uint32_t;
}
extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: size_t);
}
extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(
        __pwcs: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn wcstombs(
        __s: *mut ::std::os::raw::c_char,
        __pwcs: *const wchar_t,
        __n: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    fn test_field___clang_max_align_nonce1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<max_align_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(max_align_t),
                "::",
                stringify!(__clang_max_align_nonce1)
            )
        );
    }
    test_field___clang_max_align_nonce1();
    fn test_field___clang_max_align_nonce2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<max_align_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(max_align_t),
                "::",
                stringify!(__clang_max_align_nonce2)
            )
        );
    }
    test_field___clang_max_align_nonce2();
}
pub const memory_order_memory_order_relaxed: memory_order = 0;
pub const memory_order_memory_order_consume: memory_order = 1;
pub const memory_order_memory_order_acquire: memory_order = 2;
pub const memory_order_memory_order_release: memory_order = 3;
pub const memory_order_memory_order_acq_rel: memory_order = 4;
pub const memory_order_memory_order_seq_cst: memory_order = 5;
pub type memory_order = ::std::os::raw::c_uint;
extern "C" {
    pub fn atomic_thread_fence(arg1: memory_order);
}
extern "C" {
    pub fn atomic_signal_fence(arg1: memory_order);
}
pub type atomic_bool = u8;
pub type atomic_char = u8;
pub type atomic_schar = u8;
pub type atomic_uchar = u8;
pub type atomic_short = u16;
pub type atomic_ushort = u16;
pub type atomic_int = u32;
pub type atomic_uint = u32;
pub type atomic_long = u64;
pub type atomic_ulong = u64;
pub type atomic_llong = u64;
pub type atomic_ullong = u64;
pub type atomic_char16_t = u16;
pub type atomic_char32_t = u32;
pub type atomic_wchar_t = u32;
pub type atomic_int_least8_t = u8;
pub type atomic_uint_least8_t = u8;
pub type atomic_int_least16_t = u16;
pub type atomic_uint_least16_t = u16;
pub type atomic_int_least32_t = u32;
pub type atomic_uint_least32_t = u32;
pub type atomic_int_least64_t = u64;
pub type atomic_uint_least64_t = u64;
pub type atomic_int_fast8_t = u8;
pub type atomic_uint_fast8_t = u8;
pub type atomic_int_fast16_t = u64;
pub type atomic_uint_fast16_t = u64;
pub type atomic_int_fast32_t = u64;
pub type atomic_uint_fast32_t = u64;
pub type atomic_int_fast64_t = u64;
pub type atomic_uint_fast64_t = u64;
pub type atomic_intptr_t = u64;
pub type atomic_uintptr_t = u64;
pub type atomic_size_t = u64;
pub type atomic_ptrdiff_t = u64;
pub type atomic_intmax_t = u64;
pub type atomic_uintmax_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct atomic_flag {
    pub _Value: atomic_bool,
}
#[test]
fn bindgen_test_layout_atomic_flag() {
    assert_eq!(
        ::std::mem::size_of::<atomic_flag>(),
        1usize,
        concat!("Size of: ", stringify!(atomic_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<atomic_flag>(),
        1usize,
        concat!("Alignment of ", stringify!(atomic_flag))
    );
    fn test_field__Value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<atomic_flag>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Value) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(atomic_flag),
                "::",
                stringify!(_Value)
            )
        );
    }
    test_field__Value();
}
extern "C" {
    pub fn atomic_flag_test_and_set(arg1: *mut atomic_flag) -> bool;
}
extern "C" {
    pub fn atomic_flag_test_and_set_explicit(arg1: *mut atomic_flag, arg2: memory_order) -> bool;
}
extern "C" {
    pub fn atomic_flag_clear(arg1: *mut atomic_flag);
}
extern "C" {
    pub fn atomic_flag_clear_explicit(arg1: *mut atomic_flag, arg2: memory_order);
}
pub type l_atomic = atomic_int;
pub type l_intptr_t = isize;
pub type l_uintptr_t = usize;
pub type l_ok = ::std::os::raw::c_int;
pub type l_int8 = ::std::os::raw::c_schar;
pub type l_uint8 = ::std::os::raw::c_uchar;
pub type l_int16 = ::std::os::raw::c_short;
pub type l_uint16 = ::std::os::raw::c_ushort;
pub type l_int32 = ::std::os::raw::c_int;
pub type l_uint32 = ::std::os::raw::c_uint;
pub type l_float32 = f32;
pub type l_float64 = f64;
pub type l_int64 = ::std::os::raw::c_longlong;
pub type l_uint64 = ::std::os::raw::c_ulonglong;
extern "C" {
    pub static mut LeptDebugOK: l_int32;
}
pub const L_NOT_FOUND: _bindgen_ty_1 = 0;
pub const L_FOUND: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const UNIX_PATH_SEPCHAR: _bindgen_ty_2 = 0;
pub const WIN_PATH_SEPCHAR: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub type L_TIMER = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_WallTimer {
    pub start_sec: l_int32,
    pub start_usec: l_int32,
    pub stop_sec: l_int32,
    pub stop_usec: l_int32,
}
#[test]
fn bindgen_test_layout_L_WallTimer() {
    assert_eq!(
        ::std::mem::size_of::<L_WallTimer>(),
        16usize,
        concat!("Size of: ", stringify!(L_WallTimer))
    );
    assert_eq!(
        ::std::mem::align_of::<L_WallTimer>(),
        4usize,
        concat!("Alignment of ", stringify!(L_WallTimer))
    );
    fn test_field_start_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_WallTimer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).start_sec) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_WallTimer),
                "::",
                stringify!(start_sec)
            )
        );
    }
    test_field_start_sec();
    fn test_field_start_usec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_WallTimer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).start_usec) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_WallTimer),
                "::",
                stringify!(start_usec)
            )
        );
    }
    test_field_start_usec();
    fn test_field_stop_sec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_WallTimer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).stop_sec) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_WallTimer),
                "::",
                stringify!(stop_sec)
            )
        );
    }
    test_field_stop_sec();
    fn test_field_stop_usec() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_WallTimer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).stop_usec) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(L_WallTimer),
                "::",
                stringify!(stop_usec)
            )
        );
    }
    test_field_stop_usec();
}
pub type L_WALLTIMER = L_WallTimer;
pub const L_SEVERITY_EXTERNAL: _bindgen_ty_3 = 0;
pub const L_SEVERITY_ALL: _bindgen_ty_3 = 1;
pub const L_SEVERITY_DEBUG: _bindgen_ty_3 = 2;
pub const L_SEVERITY_INFO: _bindgen_ty_3 = 3;
pub const L_SEVERITY_WARNING: _bindgen_ty_3 = 4;
pub const L_SEVERITY_ERROR: _bindgen_ty_3 = 5;
pub const L_SEVERITY_NONE: _bindgen_ty_3 = 6;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub static mut LeptMsgSeverity: l_int32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Numa {
    _unused: [u8; 0],
}
pub type NUMA = Numa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Numaa {
    _unused: [u8; 0],
}
pub type NUMAA = Numaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dna {
    _unused: [u8; 0],
}
pub type L_DNA = L_Dna;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dnaa {
    _unused: [u8; 0],
}
pub type L_DNAA = L_Dnaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_DnaHash {
    _unused: [u8; 0],
}
pub type L_DNAHASH = L_DnaHash;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sarray {
    _unused: [u8; 0],
}
pub type SARRAY = Sarray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Bytea {
    _unused: [u8; 0],
}
pub type L_BYTEA = L_Bytea;
pub const L_LINEAR_INTERP: _bindgen_ty_4 = 1;
pub const L_QUADRATIC_INTERP: _bindgen_ty_4 = 2;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const L_CONTINUED_BORDER: _bindgen_ty_5 = 1;
pub const L_SLOPE_BORDER: _bindgen_ty_5 = 2;
pub const L_MIRRORED_BORDER: _bindgen_ty_5 = 3;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const L_INTEGER_VALUE: _bindgen_ty_6 = 1;
pub const L_FLOAT_VALUE: _bindgen_ty_6 = 2;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_ByteBuffer {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub nwritten: l_int32,
    pub array: *mut l_uint8,
}
#[test]
fn bindgen_test_layout_L_ByteBuffer() {
    assert_eq!(
        ::std::mem::size_of::<L_ByteBuffer>(),
        24usize,
        concat!("Size of: ", stringify!(L_ByteBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<L_ByteBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(L_ByteBuffer))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_ByteBuffer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_ByteBuffer),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_n() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_ByteBuffer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_ByteBuffer),
                "::",
                stringify!(n)
            )
        );
    }
    test_field_n();
    fn test_field_nwritten() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_ByteBuffer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nwritten) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_ByteBuffer),
                "::",
                stringify!(nwritten)
            )
        );
    }
    test_field_nwritten();
    fn test_field_array() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_ByteBuffer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_ByteBuffer),
                "::",
                stringify!(array)
            )
        );
    }
    test_field_array();
}
pub type L_BBUFFER = L_ByteBuffer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Hashmap {
    pub nitems: l_int32,
    pub ntogo: l_int32,
    pub maxocc: l_int32,
    pub hashtab: *mut *mut L_Hashitem,
    pub tabsize: l_int32,
}
#[test]
fn bindgen_test_layout_L_Hashmap() {
    assert_eq!(
        ::std::mem::size_of::<L_Hashmap>(),
        32usize,
        concat!("Size of: ", stringify!(L_Hashmap))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Hashmap>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Hashmap))
    );
    fn test_field_nitems() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nitems) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashmap),
                "::",
                stringify!(nitems)
            )
        );
    }
    test_field_nitems();
    fn test_field_ntogo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ntogo) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashmap),
                "::",
                stringify!(ntogo)
            )
        );
    }
    test_field_ntogo();
    fn test_field_maxocc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxocc) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashmap),
                "::",
                stringify!(maxocc)
            )
        );
    }
    test_field_maxocc();
    fn test_field_hashtab() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hashtab) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashmap),
                "::",
                stringify!(hashtab)
            )
        );
    }
    test_field_hashtab();
    fn test_field_tabsize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashmap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tabsize) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashmap),
                "::",
                stringify!(tabsize)
            )
        );
    }
    test_field_tabsize();
}
pub type L_HASHMAP = L_Hashmap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Hashitem {
    pub key: l_uint64,
    pub val: l_uint64,
    pub count: l_int32,
    pub next: *mut L_Hashitem,
}
#[test]
fn bindgen_test_layout_L_Hashitem() {
    assert_eq!(
        ::std::mem::size_of::<L_Hashitem>(),
        32usize,
        concat!("Size of: ", stringify!(L_Hashitem))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Hashitem>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Hashitem))
    );
    fn test_field_key() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashitem>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashitem),
                "::",
                stringify!(key)
            )
        );
    }
    test_field_key();
    fn test_field_val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashitem>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashitem),
                "::",
                stringify!(val)
            )
        );
    }
    test_field_val();
    fn test_field_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashitem>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashitem),
                "::",
                stringify!(count)
            )
        );
    }
    test_field_count();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Hashitem>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Hashitem),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
pub type L_HASHITEM = L_Hashitem;
pub const L_UNDEFINED: _bindgen_ty_7 = 0;
pub const L_HMAP_CHECK: _bindgen_ty_7 = 1;
pub const L_HMAP_CREATE: _bindgen_ty_7 = 2;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Heap {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
    pub direction: l_int32,
}
#[test]
fn bindgen_test_layout_L_Heap() {
    assert_eq!(
        ::std::mem::size_of::<L_Heap>(),
        24usize,
        concat!("Size of: ", stringify!(L_Heap))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Heap>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Heap))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Heap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Heap),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_n() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Heap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize
            },
            4usize,
            concat!("Offset of field: ", stringify!(L_Heap), "::", stringify!(n))
        );
    }
    test_field_n();
    fn test_field_array() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Heap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Heap),
                "::",
                stringify!(array)
            )
        );
    }
    test_field_array();
    fn test_field_direction() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Heap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).direction) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Heap),
                "::",
                stringify!(direction)
            )
        );
    }
    test_field_direction();
}
pub type L_HEAP = L_Heap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DoubleLinkedList {
    pub prev: *mut DoubleLinkedList,
    pub next: *mut DoubleLinkedList,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_DoubleLinkedList() {
    assert_eq!(
        ::std::mem::size_of::<DoubleLinkedList>(),
        24usize,
        concat!("Size of: ", stringify!(DoubleLinkedList))
    );
    assert_eq!(
        ::std::mem::align_of::<DoubleLinkedList>(),
        8usize,
        concat!("Alignment of ", stringify!(DoubleLinkedList))
    );
    fn test_field_prev() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DoubleLinkedList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(DoubleLinkedList),
                "::",
                stringify!(prev)
            )
        );
    }
    test_field_prev();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DoubleLinkedList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(DoubleLinkedList),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<DoubleLinkedList>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(DoubleLinkedList),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
pub type DLLIST = DoubleLinkedList;
extern "C" {
    pub static MaxInitPtraSize: l_uint32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Ptra {
    pub nalloc: l_int32,
    pub imax: l_int32,
    pub nactual: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_L_Ptra() {
    assert_eq!(
        ::std::mem::size_of::<L_Ptra>(),
        24usize,
        concat!("Size of: ", stringify!(L_Ptra))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Ptra>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Ptra))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Ptra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Ptra),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_imax() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Ptra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imax) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Ptra),
                "::",
                stringify!(imax)
            )
        );
    }
    test_field_imax();
    fn test_field_nactual() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Ptra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nactual) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Ptra),
                "::",
                stringify!(nactual)
            )
        );
    }
    test_field_nactual();
    fn test_field_array() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Ptra>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Ptra),
                "::",
                stringify!(array)
            )
        );
    }
    test_field_array();
}
pub type L_PTRA = L_Ptra;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Ptraa {
    pub nalloc: l_int32,
    pub ptra: *mut *mut L_Ptra,
}
#[test]
fn bindgen_test_layout_L_Ptraa() {
    assert_eq!(
        ::std::mem::size_of::<L_Ptraa>(),
        16usize,
        concat!("Size of: ", stringify!(L_Ptraa))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Ptraa>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Ptraa))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Ptraa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Ptraa),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_ptra() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Ptraa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptra) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Ptraa),
                "::",
                stringify!(ptra)
            )
        );
    }
    test_field_ptra();
}
pub type L_PTRAA = L_Ptraa;
pub const L_NO_COMPACTION: _bindgen_ty_8 = 1;
pub const L_COMPACTION: _bindgen_ty_8 = 2;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const L_AUTO_DOWNSHIFT: _bindgen_ty_9 = 0;
pub const L_MIN_DOWNSHIFT: _bindgen_ty_9 = 1;
pub const L_FULL_DOWNSHIFT: _bindgen_ty_9 = 2;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const L_HANDLE_ONLY: _bindgen_ty_10 = 0;
pub const L_REMOVE: _bindgen_ty_10 = 1;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Queue {
    pub nalloc: l_int32,
    pub nhead: l_int32,
    pub nelem: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
    pub stack: *mut L_Stack,
}
#[test]
fn bindgen_test_layout_L_Queue() {
    assert_eq!(
        ::std::mem::size_of::<L_Queue>(),
        32usize,
        concat!("Size of: ", stringify!(L_Queue))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Queue>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Queue))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Queue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Queue),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_nhead() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Queue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nhead) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Queue),
                "::",
                stringify!(nhead)
            )
        );
    }
    test_field_nhead();
    fn test_field_nelem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Queue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nelem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Queue),
                "::",
                stringify!(nelem)
            )
        );
    }
    test_field_nelem();
    fn test_field_array() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Queue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Queue),
                "::",
                stringify!(array)
            )
        );
    }
    test_field_array();
    fn test_field_stack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Queue>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).stack) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Queue),
                "::",
                stringify!(stack)
            )
        );
    }
    test_field_stack();
}
pub type L_QUEUE = L_Queue;
pub const L_INT_TYPE: _bindgen_ty_11 = 1;
pub const L_UINT_TYPE: _bindgen_ty_11 = 2;
pub const L_FLOAT_TYPE: _bindgen_ty_11 = 3;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union Rb_Type {
    pub itype: l_int64,
    pub utype: l_uint64,
    pub ftype: l_float64,
    pub ptype: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Rb_Type() {
    assert_eq!(
        ::std::mem::size_of::<Rb_Type>(),
        8usize,
        concat!("Size of: ", stringify!(Rb_Type))
    );
    assert_eq!(
        ::std::mem::align_of::<Rb_Type>(),
        8usize,
        concat!("Alignment of ", stringify!(Rb_Type))
    );
    fn test_field_itype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Rb_Type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).itype) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Rb_Type),
                "::",
                stringify!(itype)
            )
        );
    }
    test_field_itype();
    fn test_field_utype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Rb_Type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).utype) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Rb_Type),
                "::",
                stringify!(utype)
            )
        );
    }
    test_field_utype();
    fn test_field_ftype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Rb_Type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ftype) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Rb_Type),
                "::",
                stringify!(ftype)
            )
        );
    }
    test_field_ftype();
    fn test_field_ptype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Rb_Type>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptype) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(Rb_Type),
                "::",
                stringify!(ptype)
            )
        );
    }
    test_field_ptype();
}
pub type RB_TYPE = Rb_Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Rbtree {
    pub root: *mut L_Rbtree_Node,
    pub keytype: l_int32,
}
#[test]
fn bindgen_test_layout_L_Rbtree() {
    assert_eq!(
        ::std::mem::size_of::<L_Rbtree>(),
        16usize,
        concat!("Size of: ", stringify!(L_Rbtree))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rbtree>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rbtree))
    );
    fn test_field_root() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).root) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree),
                "::",
                stringify!(root)
            )
        );
    }
    test_field_root();
    fn test_field_keytype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).keytype) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree),
                "::",
                stringify!(keytype)
            )
        );
    }
    test_field_keytype();
}
pub type L_RBTREE = L_Rbtree;
pub type L_AMAP = L_Rbtree;
pub type L_ASET = L_Rbtree;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct L_Rbtree_Node {
    pub key: Rb_Type,
    pub value: Rb_Type,
    pub left: *mut L_Rbtree_Node,
    pub right: *mut L_Rbtree_Node,
    pub parent: *mut L_Rbtree_Node,
    pub color: l_int32,
}
#[test]
fn bindgen_test_layout_L_Rbtree_Node() {
    assert_eq!(
        ::std::mem::size_of::<L_Rbtree_Node>(),
        48usize,
        concat!("Size of: ", stringify!(L_Rbtree_Node))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Rbtree_Node>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Rbtree_Node))
    );
    fn test_field_key() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree_Node>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree_Node),
                "::",
                stringify!(key)
            )
        );
    }
    test_field_key();
    fn test_field_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree_Node>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree_Node),
                "::",
                stringify!(value)
            )
        );
    }
    test_field_value();
    fn test_field_left() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree_Node>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree_Node),
                "::",
                stringify!(left)
            )
        );
    }
    test_field_left();
    fn test_field_right() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree_Node>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree_Node),
                "::",
                stringify!(right)
            )
        );
    }
    test_field_right();
    fn test_field_parent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree_Node>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree_Node),
                "::",
                stringify!(parent)
            )
        );
    }
    test_field_parent();
    fn test_field_color() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Rbtree_Node>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Rbtree_Node),
                "::",
                stringify!(color)
            )
        );
    }
    test_field_color();
}
pub type L_RBTREE_NODE = L_Rbtree_Node;
pub type L_AMAP_NODE = L_Rbtree_Node;
pub type L_ASET_NODE = L_Rbtree_Node;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Stack {
    pub nalloc: l_int32,
    pub n: l_int32,
    pub array: *mut *mut ::std::os::raw::c_void,
    pub auxstack: *mut L_Stack,
}
#[test]
fn bindgen_test_layout_L_Stack() {
    assert_eq!(
        ::std::mem::size_of::<L_Stack>(),
        24usize,
        concat!("Size of: ", stringify!(L_Stack))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Stack>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Stack))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Stack>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Stack),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_n() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Stack>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Stack),
                "::",
                stringify!(n)
            )
        );
    }
    test_field_n();
    fn test_field_array() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Stack>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Stack),
                "::",
                stringify!(array)
            )
        );
    }
    test_field_array();
    fn test_field_auxstack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Stack>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).auxstack) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Stack),
                "::",
                stringify!(auxstack)
            )
        );
    }
    test_field_auxstack();
}
pub type L_STACK = L_Stack;
pub const SPLIT_ON_LEADING_WHITE: _bindgen_ty_12 = 1;
pub const SPLIT_ON_BLANK_LINE: _bindgen_ty_12 = 2;
pub const SPLIT_ON_BOTH: _bindgen_ty_12 = 3;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Bmf {
    pub pixa: *mut Pixa,
    pub size: l_int32,
    pub directory: *mut ::std::os::raw::c_char,
    pub baseline1: l_int32,
    pub baseline2: l_int32,
    pub baseline3: l_int32,
    pub lineheight: l_int32,
    pub kernwidth: l_int32,
    pub spacewidth: l_int32,
    pub vertlinesep: l_int32,
    pub fonttab: *mut l_int32,
    pub baselinetab: *mut l_int32,
    pub widthtab: *mut l_int32,
}
#[test]
fn bindgen_test_layout_L_Bmf() {
    assert_eq!(
        ::std::mem::size_of::<L_Bmf>(),
        80usize,
        concat!("Size of: ", stringify!(L_Bmf))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Bmf>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Bmf))
    );
    fn test_field_pixa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixa) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(pixa)
            )
        );
    }
    test_field_pixa();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_directory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).directory) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(directory)
            )
        );
    }
    test_field_directory();
    fn test_field_baseline1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseline1) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(baseline1)
            )
        );
    }
    test_field_baseline1();
    fn test_field_baseline2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseline2) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(baseline2)
            )
        );
    }
    test_field_baseline2();
    fn test_field_baseline3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseline3) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(baseline3)
            )
        );
    }
    test_field_baseline3();
    fn test_field_lineheight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lineheight) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(lineheight)
            )
        );
    }
    test_field_lineheight();
    fn test_field_kernwidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).kernwidth) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(kernwidth)
            )
        );
    }
    test_field_kernwidth();
    fn test_field_spacewidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spacewidth) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(spacewidth)
            )
        );
    }
    test_field_spacewidth();
    fn test_field_vertlinesep() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vertlinesep) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(vertlinesep)
            )
        );
    }
    test_field_vertlinesep();
    fn test_field_fonttab() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fonttab) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(fonttab)
            )
        );
    }
    test_field_fonttab();
    fn test_field_baselinetab() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baselinetab) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(baselinetab)
            )
        );
    }
    test_field_baselinetab();
    fn test_field_widthtab() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Bmf>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).widthtab) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Bmf),
                "::",
                stringify!(widthtab)
            )
        );
    }
    test_field_widthtab();
}
pub type L_BMF = L_Bmf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCBord {
    _unused: [u8; 0],
}
pub type CCBORD = CCBord;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCBorda {
    _unused: [u8; 0],
}
pub type CCBORDA = CCBorda;
pub const CCB_LOCAL_COORDS: _bindgen_ty_13 = 1;
pub const CCB_GLOBAL_COORDS: _bindgen_ty_13 = 2;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
pub const CCB_SAVE_ALL_PTS: _bindgen_ty_14 = 1;
pub const CCB_SAVE_TURNING_PTS: _bindgen_ty_14 = 2;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Colorfill {
    pub pixs: *mut Pix,
    pub pixst: *mut Pix,
    pub nx: l_int32,
    pub ny: l_int32,
    pub tw: l_int32,
    pub th: l_int32,
    pub minarea: l_int32,
    pub boxas: *mut Boxa,
    pub pixas: *mut Pixa,
    pub pixam: *mut Pixa,
    pub naa: *mut Numaa,
    pub dnaa: *mut L_Dnaa,
    pub pixadb: *mut Pixa,
}
#[test]
fn bindgen_test_layout_L_Colorfill() {
    assert_eq!(
        ::std::mem::size_of::<L_Colorfill>(),
        88usize,
        concat!("Size of: ", stringify!(L_Colorfill))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Colorfill>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Colorfill))
    );
    fn test_field_pixs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixs) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(pixs)
            )
        );
    }
    test_field_pixs();
    fn test_field_pixst() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixst) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(pixst)
            )
        );
    }
    test_field_pixst();
    fn test_field_nx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nx) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(nx)
            )
        );
    }
    test_field_nx();
    fn test_field_ny() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ny) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(ny)
            )
        );
    }
    test_field_ny();
    fn test_field_tw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tw) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(tw)
            )
        );
    }
    test_field_tw();
    fn test_field_th() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).th) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(th)
            )
        );
    }
    test_field_th();
    fn test_field_minarea() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minarea) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(minarea)
            )
        );
    }
    test_field_minarea();
    fn test_field_boxas() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).boxas) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(boxas)
            )
        );
    }
    test_field_boxas();
    fn test_field_pixas() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixas) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(pixas)
            )
        );
    }
    test_field_pixas();
    fn test_field_pixam() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixam) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(pixam)
            )
        );
    }
    test_field_pixam();
    fn test_field_naa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).naa) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(naa)
            )
        );
    }
    test_field_naa();
    fn test_field_dnaa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dnaa) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(dnaa)
            )
        );
    }
    test_field_dnaa();
    fn test_field_pixadb() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Colorfill>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixadb) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Colorfill),
                "::",
                stringify!(pixadb)
            )
        );
    }
    test_field_pixadb();
}
pub type L_COLORFILL = L_Colorfill;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dewarpa {
    pub nalloc: l_int32,
    pub maxpage: l_int32,
    pub dewarp: *mut *mut L_Dewarp,
    pub dewarpcache: *mut *mut L_Dewarp,
    pub namodels: *mut Numa,
    pub napages: *mut Numa,
    pub redfactor: l_int32,
    pub sampling: l_int32,
    pub minlines: l_int32,
    pub maxdist: l_int32,
    pub max_linecurv: l_int32,
    pub min_diff_linecurv: l_int32,
    pub max_diff_linecurv: l_int32,
    pub max_edgeslope: l_int32,
    pub max_edgecurv: l_int32,
    pub max_diff_edgecurv: l_int32,
    pub useboth: l_int32,
    pub check_columns: l_int32,
    pub modelsready: l_int32,
}
#[test]
fn bindgen_test_layout_L_Dewarpa() {
    assert_eq!(
        ::std::mem::size_of::<L_Dewarpa>(),
        96usize,
        concat!("Size of: ", stringify!(L_Dewarpa))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Dewarpa>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Dewarpa))
    );
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_maxpage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxpage) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(maxpage)
            )
        );
    }
    test_field_maxpage();
    fn test_field_dewarp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dewarp) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(dewarp)
            )
        );
    }
    test_field_dewarp();
    fn test_field_dewarpcache() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dewarpcache) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(dewarpcache)
            )
        );
    }
    test_field_dewarpcache();
    fn test_field_namodels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).namodels) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(namodels)
            )
        );
    }
    test_field_namodels();
    fn test_field_napages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).napages) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(napages)
            )
        );
    }
    test_field_napages();
    fn test_field_redfactor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).redfactor) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(redfactor)
            )
        );
    }
    test_field_redfactor();
    fn test_field_sampling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampling) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(sampling)
            )
        );
    }
    test_field_sampling();
    fn test_field_minlines() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minlines) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(minlines)
            )
        );
    }
    test_field_minlines();
    fn test_field_maxdist() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxdist) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(maxdist)
            )
        );
    }
    test_field_maxdist();
    fn test_field_max_linecurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_linecurv) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(max_linecurv)
            )
        );
    }
    test_field_max_linecurv();
    fn test_field_min_diff_linecurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).min_diff_linecurv) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(min_diff_linecurv)
            )
        );
    }
    test_field_min_diff_linecurv();
    fn test_field_max_diff_linecurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_diff_linecurv) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(max_diff_linecurv)
            )
        );
    }
    test_field_max_diff_linecurv();
    fn test_field_max_edgeslope() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_edgeslope) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(max_edgeslope)
            )
        );
    }
    test_field_max_edgeslope();
    fn test_field_max_edgecurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_edgecurv) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(max_edgecurv)
            )
        );
    }
    test_field_max_edgecurv();
    fn test_field_max_diff_edgecurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_diff_edgecurv) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(max_diff_edgecurv)
            )
        );
    }
    test_field_max_diff_edgecurv();
    fn test_field_useboth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).useboth) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(useboth)
            )
        );
    }
    test_field_useboth();
    fn test_field_check_columns() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).check_columns) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(check_columns)
            )
        );
    }
    test_field_check_columns();
    fn test_field_modelsready() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarpa>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).modelsready) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarpa),
                "::",
                stringify!(modelsready)
            )
        );
    }
    test_field_modelsready();
}
pub type L_DEWARPA = L_Dewarpa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Dewarp {
    pub dewa: *mut L_Dewarpa,
    pub pixs: *mut Pix,
    pub sampvdispar: *mut FPix,
    pub samphdispar: *mut FPix,
    pub sampydispar: *mut FPix,
    pub fullvdispar: *mut FPix,
    pub fullhdispar: *mut FPix,
    pub fullydispar: *mut FPix,
    pub namidys: *mut Numa,
    pub nacurves: *mut Numa,
    pub w: l_int32,
    pub h: l_int32,
    pub pageno: l_int32,
    pub sampling: l_int32,
    pub redfactor: l_int32,
    pub minlines: l_int32,
    pub nlines: l_int32,
    pub mincurv: l_int32,
    pub maxcurv: l_int32,
    pub leftslope: l_int32,
    pub rightslope: l_int32,
    pub leftcurv: l_int32,
    pub rightcurv: l_int32,
    pub nx: l_int32,
    pub ny: l_int32,
    pub hasref: l_int32,
    pub refpage: l_int32,
    pub vsuccess: l_int32,
    pub hsuccess: l_int32,
    pub ysuccess: l_int32,
    pub vvalid: l_int32,
    pub hvalid: l_int32,
    pub skip_horiz: l_int32,
    pub debug: l_int32,
}
#[test]
fn bindgen_test_layout_L_Dewarp() {
    assert_eq!(
        ::std::mem::size_of::<L_Dewarp>(),
        176usize,
        concat!("Size of: ", stringify!(L_Dewarp))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Dewarp>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Dewarp))
    );
    fn test_field_dewa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dewa) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(dewa)
            )
        );
    }
    test_field_dewa();
    fn test_field_pixs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixs) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(pixs)
            )
        );
    }
    test_field_pixs();
    fn test_field_sampvdispar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampvdispar) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(sampvdispar)
            )
        );
    }
    test_field_sampvdispar();
    fn test_field_samphdispar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).samphdispar) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(samphdispar)
            )
        );
    }
    test_field_samphdispar();
    fn test_field_sampydispar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampydispar) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(sampydispar)
            )
        );
    }
    test_field_sampydispar();
    fn test_field_fullvdispar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fullvdispar) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(fullvdispar)
            )
        );
    }
    test_field_fullvdispar();
    fn test_field_fullhdispar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fullhdispar) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(fullhdispar)
            )
        );
    }
    test_field_fullhdispar();
    fn test_field_fullydispar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fullydispar) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(fullydispar)
            )
        );
    }
    test_field_fullydispar();
    fn test_field_namidys() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).namidys) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(namidys)
            )
        );
    }
    test_field_namidys();
    fn test_field_nacurves() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nacurves) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(nacurves)
            )
        );
    }
    test_field_nacurves();
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(w)
            )
        );
    }
    test_field_w();
    fn test_field_h() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(h)
            )
        );
    }
    test_field_h();
    fn test_field_pageno() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pageno) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(pageno)
            )
        );
    }
    test_field_pageno();
    fn test_field_sampling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampling) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(sampling)
            )
        );
    }
    test_field_sampling();
    fn test_field_redfactor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).redfactor) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(redfactor)
            )
        );
    }
    test_field_redfactor();
    fn test_field_minlines() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minlines) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(minlines)
            )
        );
    }
    test_field_minlines();
    fn test_field_nlines() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nlines) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(nlines)
            )
        );
    }
    test_field_nlines();
    fn test_field_mincurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mincurv) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(mincurv)
            )
        );
    }
    test_field_mincurv();
    fn test_field_maxcurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxcurv) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(maxcurv)
            )
        );
    }
    test_field_maxcurv();
    fn test_field_leftslope() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).leftslope) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(leftslope)
            )
        );
    }
    test_field_leftslope();
    fn test_field_rightslope() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rightslope) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(rightslope)
            )
        );
    }
    test_field_rightslope();
    fn test_field_leftcurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).leftcurv) as usize - ptr as usize
            },
            124usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(leftcurv)
            )
        );
    }
    test_field_leftcurv();
    fn test_field_rightcurv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rightcurv) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(rightcurv)
            )
        );
    }
    test_field_rightcurv();
    fn test_field_nx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nx) as usize - ptr as usize
            },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(nx)
            )
        );
    }
    test_field_nx();
    fn test_field_ny() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ny) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(ny)
            )
        );
    }
    test_field_ny();
    fn test_field_hasref() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hasref) as usize - ptr as usize
            },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(hasref)
            )
        );
    }
    test_field_hasref();
    fn test_field_refpage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refpage) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(refpage)
            )
        );
    }
    test_field_refpage();
    fn test_field_vsuccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vsuccess) as usize - ptr as usize
            },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(vsuccess)
            )
        );
    }
    test_field_vsuccess();
    fn test_field_hsuccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hsuccess) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(hsuccess)
            )
        );
    }
    test_field_hsuccess();
    fn test_field_ysuccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ysuccess) as usize - ptr as usize
            },
            156usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(ysuccess)
            )
        );
    }
    test_field_ysuccess();
    fn test_field_vvalid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vvalid) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(vvalid)
            )
        );
    }
    test_field_vvalid();
    fn test_field_hvalid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hvalid) as usize - ptr as usize
            },
            164usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(hvalid)
            )
        );
    }
    test_field_hvalid();
    fn test_field_skip_horiz() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).skip_horiz) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(skip_horiz)
            )
        );
    }
    test_field_skip_horiz();
    fn test_field_debug() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Dewarp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug) as usize - ptr as usize
            },
            172usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Dewarp),
                "::",
                stringify!(debug)
            )
        );
    }
    test_field_debug();
}
pub type L_DEWARP = L_Dewarp;
pub const GPLOT_STYLE_GPLOT_LINES: GPLOT_STYLE = 0;
pub const GPLOT_STYLE_GPLOT_POINTS: GPLOT_STYLE = 1;
pub const GPLOT_STYLE_GPLOT_IMPULSES: GPLOT_STYLE = 2;
pub const GPLOT_STYLE_GPLOT_LINESPOINTS: GPLOT_STYLE = 3;
pub const GPLOT_STYLE_GPLOT_DOTS: GPLOT_STYLE = 4;
pub type GPLOT_STYLE = ::std::os::raw::c_uint;
pub const GPLOT_OUTPUT_GPLOT_NONE: GPLOT_OUTPUT = 0;
pub const GPLOT_OUTPUT_GPLOT_PNG: GPLOT_OUTPUT = 1;
pub const GPLOT_OUTPUT_GPLOT_PS: GPLOT_OUTPUT = 2;
pub const GPLOT_OUTPUT_GPLOT_EPS: GPLOT_OUTPUT = 3;
pub const GPLOT_OUTPUT_GPLOT_LATEX: GPLOT_OUTPUT = 4;
pub const GPLOT_OUTPUT_GPLOT_PNM: GPLOT_OUTPUT = 5;
pub type GPLOT_OUTPUT = ::std::os::raw::c_uint;
pub const GPLOT_SCALING_GPLOT_LINEAR_SCALE: GPLOT_SCALING = 0;
pub const GPLOT_SCALING_GPLOT_LOG_SCALE_X: GPLOT_SCALING = 1;
pub const GPLOT_SCALING_GPLOT_LOG_SCALE_Y: GPLOT_SCALING = 2;
pub const GPLOT_SCALING_GPLOT_LOG_SCALE_X_Y: GPLOT_SCALING = 3;
pub type GPLOT_SCALING = ::std::os::raw::c_uint;
extern "C" {
    pub static mut gplotstylenames: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut gplotfileoutputs: [*const ::std::os::raw::c_char; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GPlot {
    pub rootname: *mut ::std::os::raw::c_char,
    pub cmdname: *mut ::std::os::raw::c_char,
    pub cmddata: *mut Sarray,
    pub datanames: *mut Sarray,
    pub plotdata: *mut Sarray,
    pub plotlabels: *mut Sarray,
    pub plotstyles: *mut Numa,
    pub nplots: l_int32,
    pub outname: *mut ::std::os::raw::c_char,
    pub outformat: l_int32,
    pub scaling: l_int32,
    pub title: *mut ::std::os::raw::c_char,
    pub xlabel: *mut ::std::os::raw::c_char,
    pub ylabel: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_GPlot() {
    assert_eq!(
        ::std::mem::size_of::<GPlot>(),
        104usize,
        concat!("Size of: ", stringify!(GPlot))
    );
    assert_eq!(
        ::std::mem::align_of::<GPlot>(),
        8usize,
        concat!("Alignment of ", stringify!(GPlot))
    );
    fn test_field_rootname() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rootname) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(rootname)
            )
        );
    }
    test_field_rootname();
    fn test_field_cmdname() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmdname) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(cmdname)
            )
        );
    }
    test_field_cmdname();
    fn test_field_cmddata() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmddata) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(cmddata)
            )
        );
    }
    test_field_cmddata();
    fn test_field_datanames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).datanames) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(datanames)
            )
        );
    }
    test_field_datanames();
    fn test_field_plotdata() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).plotdata) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(plotdata)
            )
        );
    }
    test_field_plotdata();
    fn test_field_plotlabels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).plotlabels) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(plotlabels)
            )
        );
    }
    test_field_plotlabels();
    fn test_field_plotstyles() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).plotstyles) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(plotstyles)
            )
        );
    }
    test_field_plotstyles();
    fn test_field_nplots() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nplots) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(nplots)
            )
        );
    }
    test_field_nplots();
    fn test_field_outname() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).outname) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(outname)
            )
        );
    }
    test_field_outname();
    fn test_field_outformat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).outformat) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(outformat)
            )
        );
    }
    test_field_outformat();
    fn test_field_scaling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scaling) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(scaling)
            )
        );
    }
    test_field_scaling();
    fn test_field_title() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).title) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(title)
            )
        );
    }
    test_field_title();
    fn test_field_xlabel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xlabel) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(xlabel)
            )
        );
    }
    test_field_xlabel();
    fn test_field_ylabel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GPlot>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ylabel) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(GPlot),
                "::",
                stringify!(ylabel)
            )
        );
    }
    test_field_ylabel();
}
pub type GPLOT = GPlot;
pub const IFF_UNKNOWN: _bindgen_ty_15 = 0;
pub const IFF_BMP: _bindgen_ty_15 = 1;
pub const IFF_JFIF_JPEG: _bindgen_ty_15 = 2;
pub const IFF_PNG: _bindgen_ty_15 = 3;
pub const IFF_TIFF: _bindgen_ty_15 = 4;
pub const IFF_TIFF_PACKBITS: _bindgen_ty_15 = 5;
pub const IFF_TIFF_RLE: _bindgen_ty_15 = 6;
pub const IFF_TIFF_G3: _bindgen_ty_15 = 7;
pub const IFF_TIFF_G4: _bindgen_ty_15 = 8;
pub const IFF_TIFF_LZW: _bindgen_ty_15 = 9;
pub const IFF_TIFF_ZIP: _bindgen_ty_15 = 10;
pub const IFF_PNM: _bindgen_ty_15 = 11;
pub const IFF_PS: _bindgen_ty_15 = 12;
pub const IFF_GIF: _bindgen_ty_15 = 13;
pub const IFF_JP2: _bindgen_ty_15 = 14;
pub const IFF_WEBP: _bindgen_ty_15 = 15;
pub const IFF_LPDF: _bindgen_ty_15 = 16;
pub const IFF_TIFF_JPEG: _bindgen_ty_15 = 17;
pub const IFF_DEFAULT: _bindgen_ty_15 = 18;
pub const IFF_SPIX: _bindgen_ty_15 = 19;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
pub const BMP_ID: _bindgen_ty_16 = 19778;
pub const TIFF_BIGEND_ID: _bindgen_ty_16 = 19789;
pub const TIFF_LITTLEEND_ID: _bindgen_ty_16 = 18761;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
pub const L_JPEG_READ_LUMINANCE: _bindgen_ty_17 = 1;
pub const L_JPEG_CONTINUE_WITH_BAD_DATA: _bindgen_ty_17 = 2;
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
pub const L_J2K_CODEC: _bindgen_ty_18 = 1;
pub const L_JP2_CODEC: _bindgen_ty_18 = 2;
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
pub const L_DEFAULT_ENCODE: _bindgen_ty_19 = 0;
pub const L_JPEG_ENCODE: _bindgen_ty_19 = 1;
pub const L_G4_ENCODE: _bindgen_ty_19 = 2;
pub const L_FLATE_ENCODE: _bindgen_ty_19 = 3;
pub const L_JP2K_ENCODE: _bindgen_ty_19 = 4;
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Compressed_Data {
    pub type_: l_int32,
    pub datacomp: *mut l_uint8,
    pub nbytescomp: size_t,
    pub data85: *mut ::std::os::raw::c_char,
    pub nbytes85: size_t,
    pub cmapdata85: *mut ::std::os::raw::c_char,
    pub cmapdatahex: *mut ::std::os::raw::c_char,
    pub ncolors: l_int32,
    pub w: l_int32,
    pub h: l_int32,
    pub bps: l_int32,
    pub spp: l_int32,
    pub minisblack: l_int32,
    pub predictor: l_int32,
    pub nbytes: size_t,
    pub res: l_int32,
}
#[test]
fn bindgen_test_layout_L_Compressed_Data() {
    assert_eq!(
        ::std::mem::size_of::<L_Compressed_Data>(),
        104usize,
        concat!("Size of: ", stringify!(L_Compressed_Data))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Compressed_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Compressed_Data))
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_datacomp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).datacomp) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(datacomp)
            )
        );
    }
    test_field_datacomp();
    fn test_field_nbytescomp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nbytescomp) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(nbytescomp)
            )
        );
    }
    test_field_nbytescomp();
    fn test_field_data85() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data85) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(data85)
            )
        );
    }
    test_field_data85();
    fn test_field_nbytes85() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nbytes85) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(nbytes85)
            )
        );
    }
    test_field_nbytes85();
    fn test_field_cmapdata85() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmapdata85) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(cmapdata85)
            )
        );
    }
    test_field_cmapdata85();
    fn test_field_cmapdatahex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cmapdatahex) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(cmapdatahex)
            )
        );
    }
    test_field_cmapdatahex();
    fn test_field_ncolors() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ncolors) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(ncolors)
            )
        );
    }
    test_field_ncolors();
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(w)
            )
        );
    }
    test_field_w();
    fn test_field_h() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(h)
            )
        );
    }
    test_field_h();
    fn test_field_bps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bps) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(bps)
            )
        );
    }
    test_field_bps();
    fn test_field_spp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).spp) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(spp)
            )
        );
    }
    test_field_spp();
    fn test_field_minisblack() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minisblack) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(minisblack)
            )
        );
    }
    test_field_minisblack();
    fn test_field_predictor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).predictor) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(predictor)
            )
        );
    }
    test_field_predictor();
    fn test_field_nbytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nbytes) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(nbytes)
            )
        );
    }
    test_field_nbytes();
    fn test_field_res() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Compressed_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).res) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Compressed_Data),
                "::",
                stringify!(res)
            )
        );
    }
    test_field_res();
}
pub type L_COMP_DATA = L_Compressed_Data;
pub const L_FIRST_IMAGE: _bindgen_ty_20 = 1;
pub const L_NEXT_IMAGE: _bindgen_ty_20 = 2;
pub const L_LAST_IMAGE: _bindgen_ty_20 = 3;
pub type _bindgen_ty_20 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Pdf_Data {
    pub title: *mut ::std::os::raw::c_char,
    pub n: l_int32,
    pub ncmap: l_int32,
    pub cida: *mut L_Ptra,
    pub id: *mut ::std::os::raw::c_char,
    pub obj1: *mut ::std::os::raw::c_char,
    pub obj2: *mut ::std::os::raw::c_char,
    pub obj3: *mut ::std::os::raw::c_char,
    pub obj4: *mut ::std::os::raw::c_char,
    pub obj5: *mut ::std::os::raw::c_char,
    pub poststream: *mut ::std::os::raw::c_char,
    pub trailer: *mut ::std::os::raw::c_char,
    pub xy: *mut Pta,
    pub wh: *mut Pta,
    pub mediabox: *mut Box,
    pub saprex: *mut Sarray,
    pub sacmap: *mut Sarray,
    pub objsize: *mut L_Dna,
    pub objloc: *mut L_Dna,
    pub xrefloc: l_int32,
}
#[test]
fn bindgen_test_layout_L_Pdf_Data() {
    assert_eq!(
        ::std::mem::size_of::<L_Pdf_Data>(),
        152usize,
        concat!("Size of: ", stringify!(L_Pdf_Data))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Pdf_Data>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Pdf_Data))
    );
    fn test_field_title() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).title) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(title)
            )
        );
    }
    test_field_title();
    fn test_field_n() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(n)
            )
        );
    }
    test_field_n();
    fn test_field_ncmap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ncmap) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(ncmap)
            )
        );
    }
    test_field_ncmap();
    fn test_field_cida() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cida) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(cida)
            )
        );
    }
    test_field_cida();
    fn test_field_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(id)
            )
        );
    }
    test_field_id();
    fn test_field_obj1() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).obj1) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(obj1)
            )
        );
    }
    test_field_obj1();
    fn test_field_obj2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).obj2) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(obj2)
            )
        );
    }
    test_field_obj2();
    fn test_field_obj3() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).obj3) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(obj3)
            )
        );
    }
    test_field_obj3();
    fn test_field_obj4() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).obj4) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(obj4)
            )
        );
    }
    test_field_obj4();
    fn test_field_obj5() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).obj5) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(obj5)
            )
        );
    }
    test_field_obj5();
    fn test_field_poststream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).poststream) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(poststream)
            )
        );
    }
    test_field_poststream();
    fn test_field_trailer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trailer) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(trailer)
            )
        );
    }
    test_field_trailer();
    fn test_field_xy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xy) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(xy)
            )
        );
    }
    test_field_xy();
    fn test_field_wh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wh) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(wh)
            )
        );
    }
    test_field_wh();
    fn test_field_mediabox() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mediabox) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(mediabox)
            )
        );
    }
    test_field_mediabox();
    fn test_field_saprex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).saprex) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(saprex)
            )
        );
    }
    test_field_saprex();
    fn test_field_sacmap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sacmap) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(sacmap)
            )
        );
    }
    test_field_sacmap();
    fn test_field_objsize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).objsize) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(objsize)
            )
        );
    }
    test_field_objsize();
    fn test_field_objloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).objloc) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(objloc)
            )
        );
    }
    test_field_objloc();
    fn test_field_xrefloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Pdf_Data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).xrefloc) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Pdf_Data),
                "::",
                stringify!(xrefloc)
            )
        );
    }
    test_field_xrefloc();
}
pub type L_PDF_DATA = L_Pdf_Data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JbClasser {
    pub safiles: *mut Sarray,
    pub method: l_int32,
    pub components: l_int32,
    pub maxwidth: l_int32,
    pub maxheight: l_int32,
    pub npages: l_int32,
    pub baseindex: l_int32,
    pub nacomps: *mut Numa,
    pub sizehaus: l_int32,
    pub rankhaus: l_float32,
    pub thresh: l_float32,
    pub weightfactor: l_float32,
    pub naarea: *mut Numa,
    pub w: l_int32,
    pub h: l_int32,
    pub nclass: l_int32,
    pub keep_pixaa: l_int32,
    pub pixaa: *mut Pixaa,
    pub pixat: *mut Pixa,
    pub pixatd: *mut Pixa,
    pub dahash: *mut L_DnaHash,
    pub nafgt: *mut Numa,
    pub ptac: *mut Pta,
    pub ptact: *mut Pta,
    pub naclass: *mut Numa,
    pub napage: *mut Numa,
    pub ptaul: *mut Pta,
    pub ptall: *mut Pta,
}
#[test]
fn bindgen_test_layout_JbClasser() {
    assert_eq!(
        ::std::mem::size_of::<JbClasser>(),
        168usize,
        concat!("Size of: ", stringify!(JbClasser))
    );
    assert_eq!(
        ::std::mem::align_of::<JbClasser>(),
        8usize,
        concat!("Alignment of ", stringify!(JbClasser))
    );
    fn test_field_safiles() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).safiles) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(safiles)
            )
        );
    }
    test_field_safiles();
    fn test_field_method() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(method)
            )
        );
    }
    test_field_method();
    fn test_field_components() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).components) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(components)
            )
        );
    }
    test_field_components();
    fn test_field_maxwidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxwidth) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(maxwidth)
            )
        );
    }
    test_field_maxwidth();
    fn test_field_maxheight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxheight) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(maxheight)
            )
        );
    }
    test_field_maxheight();
    fn test_field_npages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).npages) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(npages)
            )
        );
    }
    test_field_npages();
    fn test_field_baseindex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseindex) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(baseindex)
            )
        );
    }
    test_field_baseindex();
    fn test_field_nacomps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nacomps) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(nacomps)
            )
        );
    }
    test_field_nacomps();
    fn test_field_sizehaus() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sizehaus) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(sizehaus)
            )
        );
    }
    test_field_sizehaus();
    fn test_field_rankhaus() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rankhaus) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(rankhaus)
            )
        );
    }
    test_field_rankhaus();
    fn test_field_thresh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).thresh) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(thresh)
            )
        );
    }
    test_field_thresh();
    fn test_field_weightfactor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).weightfactor) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(weightfactor)
            )
        );
    }
    test_field_weightfactor();
    fn test_field_naarea() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).naarea) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(naarea)
            )
        );
    }
    test_field_naarea();
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(w)
            )
        );
    }
    test_field_w();
    fn test_field_h() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(h)
            )
        );
    }
    test_field_h();
    fn test_field_nclass() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nclass) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(nclass)
            )
        );
    }
    test_field_nclass();
    fn test_field_keep_pixaa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).keep_pixaa) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(keep_pixaa)
            )
        );
    }
    test_field_keep_pixaa();
    fn test_field_pixaa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixaa) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(pixaa)
            )
        );
    }
    test_field_pixaa();
    fn test_field_pixat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixat) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(pixat)
            )
        );
    }
    test_field_pixat();
    fn test_field_pixatd() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixatd) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(pixatd)
            )
        );
    }
    test_field_pixatd();
    fn test_field_dahash() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dahash) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(dahash)
            )
        );
    }
    test_field_dahash();
    fn test_field_nafgt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nafgt) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(nafgt)
            )
        );
    }
    test_field_nafgt();
    fn test_field_ptac() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptac) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(ptac)
            )
        );
    }
    test_field_ptac();
    fn test_field_ptact() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptact) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(ptact)
            )
        );
    }
    test_field_ptact();
    fn test_field_naclass() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).naclass) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(naclass)
            )
        );
    }
    test_field_naclass();
    fn test_field_napage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).napage) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(napage)
            )
        );
    }
    test_field_napage();
    fn test_field_ptaul() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptaul) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(ptaul)
            )
        );
    }
    test_field_ptaul();
    fn test_field_ptall() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbClasser>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptall) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(JbClasser),
                "::",
                stringify!(ptall)
            )
        );
    }
    test_field_ptall();
}
pub type JBCLASSER = JbClasser;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JbData {
    pub pix: *mut Pix,
    pub npages: l_int32,
    pub w: l_int32,
    pub h: l_int32,
    pub nclass: l_int32,
    pub latticew: l_int32,
    pub latticeh: l_int32,
    pub naclass: *mut Numa,
    pub napage: *mut Numa,
    pub ptaul: *mut Pta,
}
#[test]
fn bindgen_test_layout_JbData() {
    assert_eq!(
        ::std::mem::size_of::<JbData>(),
        56usize,
        concat!("Size of: ", stringify!(JbData))
    );
    assert_eq!(
        ::std::mem::align_of::<JbData>(),
        8usize,
        concat!("Alignment of ", stringify!(JbData))
    );
    fn test_field_pix() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pix) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(pix)
            )
        );
    }
    test_field_pix();
    fn test_field_npages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).npages) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(npages)
            )
        );
    }
    test_field_npages();
    fn test_field_w() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize
            },
            12usize,
            concat!("Offset of field: ", stringify!(JbData), "::", stringify!(w))
        );
    }
    test_field_w();
    fn test_field_h() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).h) as usize - ptr as usize
            },
            16usize,
            concat!("Offset of field: ", stringify!(JbData), "::", stringify!(h))
        );
    }
    test_field_h();
    fn test_field_nclass() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nclass) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(nclass)
            )
        );
    }
    test_field_nclass();
    fn test_field_latticew() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).latticew) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(latticew)
            )
        );
    }
    test_field_latticew();
    fn test_field_latticeh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).latticeh) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(latticeh)
            )
        );
    }
    test_field_latticeh();
    fn test_field_naclass() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).naclass) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(naclass)
            )
        );
    }
    test_field_naclass();
    fn test_field_napage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).napage) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(napage)
            )
        );
    }
    test_field_napage();
    fn test_field_ptaul() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<JbData>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptaul) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(JbData),
                "::",
                stringify!(ptaul)
            )
        );
    }
    test_field_ptaul();
}
pub type JBDATA = JbData;
pub const JB_RANKHAUS: _bindgen_ty_21 = 0;
pub const JB_CORRELATION: _bindgen_ty_21 = 1;
pub type _bindgen_ty_21 = ::std::os::raw::c_uint;
pub const JB_CONN_COMPS: _bindgen_ty_22 = 0;
pub const JB_CHARACTERS: _bindgen_ty_22 = 1;
pub const JB_WORDS: _bindgen_ty_22 = 2;
pub type _bindgen_ty_22 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sel {
    pub sy: l_int32,
    pub sx: l_int32,
    pub cy: l_int32,
    pub cx: l_int32,
    pub data: *mut *mut l_int32,
    pub name: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Sel() {
    assert_eq!(
        ::std::mem::size_of::<Sel>(),
        32usize,
        concat!("Size of: ", stringify!(Sel))
    );
    assert_eq!(
        ::std::mem::align_of::<Sel>(),
        8usize,
        concat!("Alignment of ", stringify!(Sel))
    );
    fn test_field_sy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sy) as usize - ptr as usize
            },
            0usize,
            concat!("Offset of field: ", stringify!(Sel), "::", stringify!(sy))
        );
    }
    test_field_sy();
    fn test_field_sx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sx) as usize - ptr as usize
            },
            4usize,
            concat!("Offset of field: ", stringify!(Sel), "::", stringify!(sx))
        );
    }
    test_field_sx();
    fn test_field_cy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cy) as usize - ptr as usize
            },
            8usize,
            concat!("Offset of field: ", stringify!(Sel), "::", stringify!(cy))
        );
    }
    test_field_cy();
    fn test_field_cx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cx) as usize - ptr as usize
            },
            12usize,
            concat!("Offset of field: ", stringify!(Sel), "::", stringify!(cx))
        );
    }
    test_field_cx();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            16usize,
            concat!("Offset of field: ", stringify!(Sel), "::", stringify!(data))
        );
    }
    test_field_data();
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            24usize,
            concat!("Offset of field: ", stringify!(Sel), "::", stringify!(name))
        );
    }
    test_field_name();
}
pub type SEL = Sel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Sela {
    pub n: l_int32,
    pub nalloc: l_int32,
    pub sel: *mut *mut Sel,
}
#[test]
fn bindgen_test_layout_Sela() {
    assert_eq!(
        ::std::mem::size_of::<Sela>(),
        16usize,
        concat!("Size of: ", stringify!(Sela))
    );
    assert_eq!(
        ::std::mem::align_of::<Sela>(),
        8usize,
        concat!("Alignment of ", stringify!(Sela))
    );
    fn test_field_n() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sela>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).n) as usize - ptr as usize
            },
            0usize,
            concat!("Offset of field: ", stringify!(Sela), "::", stringify!(n))
        );
    }
    test_field_n();
    fn test_field_nalloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sela>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nalloc) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(Sela),
                "::",
                stringify!(nalloc)
            )
        );
    }
    test_field_nalloc();
    fn test_field_sel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<Sela>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sel) as usize - ptr as usize
            },
            8usize,
            concat!("Offset of field: ", stringify!(Sela), "::", stringify!(sel))
        );
    }
    test_field_sel();
}
pub type SELA = Sela;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Kernel {
    pub sy: l_int32,
    pub sx: l_int32,
    pub cy: l_int32,
    pub cx: l_int32,
    pub data: *mut *mut l_float32,
}
#[test]
fn bindgen_test_layout_L_Kernel() {
    assert_eq!(
        ::std::mem::size_of::<L_Kernel>(),
        24usize,
        concat!("Size of: ", stringify!(L_Kernel))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Kernel>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Kernel))
    );
    fn test_field_sy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Kernel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sy) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Kernel),
                "::",
                stringify!(sy)
            )
        );
    }
    test_field_sy();
    fn test_field_sx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Kernel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sx) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Kernel),
                "::",
                stringify!(sx)
            )
        );
    }
    test_field_sx();
    fn test_field_cy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Kernel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cy) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Kernel),
                "::",
                stringify!(cy)
            )
        );
    }
    test_field_cy();
    fn test_field_cx() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Kernel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cx) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Kernel),
                "::",
                stringify!(cx)
            )
        );
    }
    test_field_cx();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Kernel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Kernel),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
}
pub type L_KERNEL = L_Kernel;
pub const SYMMETRIC_MORPH_BC: _bindgen_ty_23 = 0;
pub const ASYMMETRIC_MORPH_BC: _bindgen_ty_23 = 1;
pub type _bindgen_ty_23 = ::std::os::raw::c_uint;
pub const SEL_DONT_CARE: _bindgen_ty_24 = 0;
pub const SEL_HIT: _bindgen_ty_24 = 1;
pub const SEL_MISS: _bindgen_ty_24 = 2;
pub type _bindgen_ty_24 = ::std::os::raw::c_uint;
pub const L_RUN_OFF: _bindgen_ty_25 = 0;
pub const L_RUN_ON: _bindgen_ty_25 = 1;
pub type _bindgen_ty_25 = ::std::os::raw::c_uint;
pub const L_HORIZ: _bindgen_ty_26 = 1;
pub const L_VERT: _bindgen_ty_26 = 2;
pub const L_BOTH_DIRECTIONS: _bindgen_ty_26 = 3;
pub type _bindgen_ty_26 = ::std::os::raw::c_uint;
pub const L_MORPH_DILATE: _bindgen_ty_27 = 1;
pub const L_MORPH_ERODE: _bindgen_ty_27 = 2;
pub const L_MORPH_OPEN: _bindgen_ty_27 = 3;
pub const L_MORPH_CLOSE: _bindgen_ty_27 = 4;
pub const L_MORPH_HMT: _bindgen_ty_27 = 5;
pub type _bindgen_ty_27 = ::std::os::raw::c_uint;
pub const L_LINEAR_SCALE: _bindgen_ty_28 = 1;
pub const L_LOG_SCALE: _bindgen_ty_28 = 2;
pub type _bindgen_ty_28 = ::std::os::raw::c_uint;
pub const L_TOPHAT_WHITE: _bindgen_ty_29 = 0;
pub const L_TOPHAT_BLACK: _bindgen_ty_29 = 1;
pub type _bindgen_ty_29 = ::std::os::raw::c_uint;
pub const L_ARITH_ADD: _bindgen_ty_30 = 1;
pub const L_ARITH_SUBTRACT: _bindgen_ty_30 = 2;
pub const L_ARITH_MULTIPLY: _bindgen_ty_30 = 3;
pub const L_ARITH_DIVIDE: _bindgen_ty_30 = 4;
pub const L_UNION: _bindgen_ty_30 = 5;
pub const L_INTERSECTION: _bindgen_ty_30 = 6;
pub const L_SUBTRACTION: _bindgen_ty_30 = 7;
pub const L_EXCLUSIVE_OR: _bindgen_ty_30 = 8;
pub type _bindgen_ty_30 = ::std::os::raw::c_uint;
pub const L_CHOOSE_MIN: _bindgen_ty_31 = 1;
pub const L_CHOOSE_MAX: _bindgen_ty_31 = 2;
pub const L_CHOOSE_MAXDIFF: _bindgen_ty_31 = 3;
pub const L_CHOOSE_MIN_BOOST: _bindgen_ty_31 = 4;
pub const L_CHOOSE_MAX_BOOST: _bindgen_ty_31 = 5;
pub type _bindgen_ty_31 = ::std::os::raw::c_uint;
pub const L_BOUNDARY_BG: _bindgen_ty_32 = 1;
pub const L_BOUNDARY_FG: _bindgen_ty_32 = 2;
pub type _bindgen_ty_32 = ::std::os::raw::c_uint;
pub const L_COMPARE_XOR: _bindgen_ty_33 = 1;
pub const L_COMPARE_SUBTRACT: _bindgen_ty_33 = 2;
pub const L_COMPARE_ABS_DIFF: _bindgen_ty_33 = 3;
pub type _bindgen_ty_33 = ::std::os::raw::c_uint;
pub const ADDED_BORDER: l_int32 = 32;
pub type PIX = Pix;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixColormap {
    _unused: [u8; 0],
}
pub type PIXCMAP = PixColormap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RGBA_Quad {
    _unused: [u8; 0],
}
pub type RGBA_QUAD = RGBA_Quad;
pub type PIXA = Pixa;
pub type PIXAA = Pixaa;
pub type BOX = Box;
pub type BOXA = Boxa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Boxaa {
    _unused: [u8; 0],
}
pub type BOXAA = Boxaa;
pub type PTA = Pta;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Ptaa {
    _unused: [u8; 0],
}
pub type PTAA = Ptaa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pixacc {
    _unused: [u8; 0],
}
pub type PIXACC = Pixacc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixTiling {
    _unused: [u8; 0],
}
pub type PIXTILING = PixTiling;
pub type FPIX = FPix;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FPixa {
    _unused: [u8; 0],
}
pub type FPIXA = FPixa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DPix {
    _unused: [u8; 0],
}
pub type DPIX = DPix;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixComp {
    _unused: [u8; 0],
}
pub type PIXC = PixComp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PixaComp {
    _unused: [u8; 0],
}
pub type PIXAC = PixaComp;
pub const COLOR_RED: _bindgen_ty_34 = 0;
pub const COLOR_GREEN: _bindgen_ty_34 = 1;
pub const COLOR_BLUE: _bindgen_ty_34 = 2;
pub const L_ALPHA_CHANNEL: _bindgen_ty_34 = 3;
pub type _bindgen_ty_34 = ::std::os::raw::c_uint;
pub const L_RED_SHIFT: l_int32 = 24;
pub const L_GREEN_SHIFT: l_int32 = 16;
pub const L_BLUE_SHIFT: l_int32 = 8;
pub const L_ALPHA_SHIFT: l_int32 = 0;
pub const L_DRAW_RED: _bindgen_ty_35 = 0;
pub const L_DRAW_GREEN: _bindgen_ty_35 = 1;
pub const L_DRAW_BLUE: _bindgen_ty_35 = 2;
pub const L_DRAW_SPECIFIED: _bindgen_ty_35 = 3;
pub const L_DRAW_RGB: _bindgen_ty_35 = 4;
pub const L_DRAW_RANDOM: _bindgen_ty_35 = 5;
pub type _bindgen_ty_35 = ::std::os::raw::c_uint;
pub const L_RED_WEIGHT: l_float32 = 0.30000001192092896;
pub const L_GREEN_WEIGHT: l_float32 = 0.5;
pub const L_BLUE_WEIGHT: l_float32 = 0.20000000298023224;
pub const REMOVE_CMAP_TO_BINARY: _bindgen_ty_36 = 0;
pub const REMOVE_CMAP_TO_GRAYSCALE: _bindgen_ty_36 = 1;
pub const REMOVE_CMAP_TO_FULL_COLOR: _bindgen_ty_36 = 2;
pub const REMOVE_CMAP_WITH_ALPHA: _bindgen_ty_36 = 3;
pub const REMOVE_CMAP_BASED_ON_SRC: _bindgen_ty_36 = 4;
pub type _bindgen_ty_36 = ::std::os::raw::c_uint;
pub const L_NOCOPY: _bindgen_ty_37 = 0;
pub const L_INSERT: _bindgen_ty_37 = 0;
pub const L_COPY: _bindgen_ty_37 = 1;
pub const L_CLONE: _bindgen_ty_37 = 2;
pub const L_COPY_CLONE: _bindgen_ty_37 = 3;
pub type _bindgen_ty_37 = ::std::os::raw::c_uint;
pub const L_SHELL_SORT: _bindgen_ty_38 = 1;
pub const L_BIN_SORT: _bindgen_ty_38 = 2;
pub type _bindgen_ty_38 = ::std::os::raw::c_uint;
pub const L_SORT_INCREASING: _bindgen_ty_39 = 1;
pub const L_SORT_DECREASING: _bindgen_ty_39 = 2;
pub type _bindgen_ty_39 = ::std::os::raw::c_uint;
pub const L_SORT_BY_X: _bindgen_ty_40 = 1;
pub const L_SORT_BY_Y: _bindgen_ty_40 = 2;
pub const L_SORT_BY_RIGHT: _bindgen_ty_40 = 3;
pub const L_SORT_BY_BOT: _bindgen_ty_40 = 4;
pub const L_SORT_BY_WIDTH: _bindgen_ty_40 = 5;
pub const L_SORT_BY_HEIGHT: _bindgen_ty_40 = 6;
pub const L_SORT_BY_MIN_DIMENSION: _bindgen_ty_40 = 7;
pub const L_SORT_BY_MAX_DIMENSION: _bindgen_ty_40 = 8;
pub const L_SORT_BY_PERIMETER: _bindgen_ty_40 = 9;
pub const L_SORT_BY_AREA: _bindgen_ty_40 = 10;
pub const L_SORT_BY_ASPECT_RATIO: _bindgen_ty_40 = 11;
pub type _bindgen_ty_40 = ::std::os::raw::c_uint;
pub const L_BLEND_WITH_INVERSE: _bindgen_ty_41 = 1;
pub const L_BLEND_TO_WHITE: _bindgen_ty_41 = 2;
pub const L_BLEND_TO_BLACK: _bindgen_ty_41 = 3;
pub const L_BLEND_GRAY: _bindgen_ty_41 = 4;
pub const L_BLEND_GRAY_WITH_INVERSE: _bindgen_ty_41 = 5;
pub type _bindgen_ty_41 = ::std::os::raw::c_uint;
pub const L_PAINT_LIGHT: _bindgen_ty_42 = 1;
pub const L_PAINT_DARK: _bindgen_ty_42 = 2;
pub type _bindgen_ty_42 = ::std::os::raw::c_uint;
pub const L_SET_PIXELS: _bindgen_ty_43 = 1;
pub const L_CLEAR_PIXELS: _bindgen_ty_43 = 2;
pub const L_FLIP_PIXELS: _bindgen_ty_43 = 3;
pub type _bindgen_ty_43 = ::std::os::raw::c_uint;
pub const L_SELECT_IF_LT: _bindgen_ty_44 = 1;
pub const L_SELECT_IF_GT: _bindgen_ty_44 = 2;
pub const L_SELECT_IF_LTE: _bindgen_ty_44 = 3;
pub const L_SELECT_IF_GTE: _bindgen_ty_44 = 4;
pub type _bindgen_ty_44 = ::std::os::raw::c_uint;
pub const L_SELECT_BY_WIDTH: _bindgen_ty_45 = 1;
pub const L_SELECT_BY_HEIGHT: _bindgen_ty_45 = 2;
pub const L_SELECT_BY_MAX_DIMENSION: _bindgen_ty_45 = 3;
pub const L_SELECT_BY_AREA: _bindgen_ty_45 = 4;
pub const L_SELECT_BY_PERIMETER: _bindgen_ty_45 = 5;
pub type _bindgen_ty_45 = ::std::os::raw::c_uint;
pub const L_SELECT_WIDTH: _bindgen_ty_46 = 1;
pub const L_SELECT_HEIGHT: _bindgen_ty_46 = 2;
pub const L_SELECT_XVAL: _bindgen_ty_46 = 3;
pub const L_SELECT_YVAL: _bindgen_ty_46 = 4;
pub const L_SELECT_IF_EITHER: _bindgen_ty_46 = 5;
pub const L_SELECT_IF_BOTH: _bindgen_ty_46 = 6;
pub type _bindgen_ty_46 = ::std::os::raw::c_uint;
pub const L_CHECK_WIDTH: _bindgen_ty_47 = 1;
pub const L_CHECK_HEIGHT: _bindgen_ty_47 = 2;
pub const L_CHECK_BOTH: _bindgen_ty_47 = 3;
pub type _bindgen_ty_47 = ::std::os::raw::c_uint;
pub const L_SELECT_RED: _bindgen_ty_48 = 1;
pub const L_SELECT_GREEN: _bindgen_ty_48 = 2;
pub const L_SELECT_BLUE: _bindgen_ty_48 = 3;
pub const L_SELECT_MIN: _bindgen_ty_48 = 4;
pub const L_SELECT_MAX: _bindgen_ty_48 = 5;
pub const L_SELECT_AVERAGE: _bindgen_ty_48 = 6;
pub const L_SELECT_HUE: _bindgen_ty_48 = 7;
pub const L_SELECT_SATURATION: _bindgen_ty_48 = 8;
pub const L_SELECT_WEIGHTED: _bindgen_ty_48 = 9;
pub type _bindgen_ty_48 = ::std::os::raw::c_uint;
pub const L_INTERMED_DIFF: _bindgen_ty_49 = 1;
pub const L_AVE_MAX_DIFF_2: _bindgen_ty_49 = 2;
pub const L_MAX_DIFF: _bindgen_ty_49 = 3;
pub type _bindgen_ty_49 = ::std::os::raw::c_uint;
pub const L_LS_BYTE: _bindgen_ty_50 = 1;
pub const L_MS_BYTE: _bindgen_ty_50 = 2;
pub const L_AUTO_BYTE: _bindgen_ty_50 = 3;
pub const L_CLIP_TO_FF: _bindgen_ty_50 = 4;
pub const L_LS_TWO_BYTES: _bindgen_ty_50 = 5;
pub const L_MS_TWO_BYTES: _bindgen_ty_50 = 6;
pub const L_CLIP_TO_FFFF: _bindgen_ty_50 = 7;
pub type _bindgen_ty_50 = ::std::os::raw::c_uint;
pub const L_ROTATE_AREA_MAP: _bindgen_ty_51 = 1;
pub const L_ROTATE_SHEAR: _bindgen_ty_51 = 2;
pub const L_ROTATE_SAMPLING: _bindgen_ty_51 = 3;
pub type _bindgen_ty_51 = ::std::os::raw::c_uint;
pub const L_BRING_IN_WHITE: _bindgen_ty_52 = 1;
pub const L_BRING_IN_BLACK: _bindgen_ty_52 = 2;
pub type _bindgen_ty_52 = ::std::os::raw::c_uint;
pub const L_SHEAR_ABOUT_CORNER: _bindgen_ty_53 = 1;
pub const L_SHEAR_ABOUT_CENTER: _bindgen_ty_53 = 2;
pub type _bindgen_ty_53 = ::std::os::raw::c_uint;
pub const L_TR_SC_RO: _bindgen_ty_54 = 1;
pub const L_SC_RO_TR: _bindgen_ty_54 = 2;
pub const L_RO_TR_SC: _bindgen_ty_54 = 3;
pub const L_TR_RO_SC: _bindgen_ty_54 = 4;
pub const L_RO_SC_TR: _bindgen_ty_54 = 5;
pub const L_SC_TR_RO: _bindgen_ty_54 = 6;
pub type _bindgen_ty_54 = ::std::os::raw::c_uint;
pub const L_FILL_WHITE: _bindgen_ty_55 = 1;
pub const L_FILL_BLACK: _bindgen_ty_55 = 2;
pub type _bindgen_ty_55 = ::std::os::raw::c_uint;
pub const L_SET_WHITE: _bindgen_ty_56 = 1;
pub const L_SET_BLACK: _bindgen_ty_56 = 2;
pub type _bindgen_ty_56 = ::std::os::raw::c_uint;
pub const L_GET_WHITE_VAL: _bindgen_ty_57 = 1;
pub const L_GET_BLACK_VAL: _bindgen_ty_57 = 2;
pub type _bindgen_ty_57 = ::std::os::raw::c_uint;
pub const L_WHITE_IS_MAX: _bindgen_ty_58 = 1;
pub const L_BLACK_IS_MAX: _bindgen_ty_58 = 2;
pub type _bindgen_ty_58 = ::std::os::raw::c_uint;
pub const DEFAULT_CLIP_LOWER_1: _bindgen_ty_59 = 10;
pub const DEFAULT_CLIP_UPPER_1: _bindgen_ty_59 = 10;
pub const DEFAULT_CLIP_LOWER_2: _bindgen_ty_59 = 5;
pub const DEFAULT_CLIP_UPPER_2: _bindgen_ty_59 = 5;
pub type _bindgen_ty_59 = ::std::os::raw::c_uint;
pub const L_MANHATTAN_DISTANCE: _bindgen_ty_60 = 1;
pub const L_EUCLIDEAN_DISTANCE: _bindgen_ty_60 = 2;
pub type _bindgen_ty_60 = ::std::os::raw::c_uint;
pub const L_NEGATIVE: _bindgen_ty_61 = 1;
pub const L_NON_NEGATIVE: _bindgen_ty_61 = 2;
pub const L_POSITIVE: _bindgen_ty_61 = 3;
pub const L_NON_POSITIVE: _bindgen_ty_61 = 4;
pub const L_ZERO: _bindgen_ty_61 = 5;
pub const L_ALL: _bindgen_ty_61 = 6;
pub type _bindgen_ty_61 = ::std::os::raw::c_uint;
pub const L_MEAN_ABSVAL: _bindgen_ty_62 = 1;
pub const L_MEDIAN_VAL: _bindgen_ty_62 = 2;
pub const L_MODE_VAL: _bindgen_ty_62 = 3;
pub const L_MODE_COUNT: _bindgen_ty_62 = 4;
pub const L_ROOT_MEAN_SQUARE: _bindgen_ty_62 = 5;
pub const L_STANDARD_DEVIATION: _bindgen_ty_62 = 6;
pub const L_VARIANCE: _bindgen_ty_62 = 7;
pub type _bindgen_ty_62 = ::std::os::raw::c_uint;
pub const L_CHOOSE_CONSECUTIVE: _bindgen_ty_63 = 1;
pub const L_CHOOSE_SKIP_BY: _bindgen_ty_63 = 2;
pub type _bindgen_ty_63 = ::std::os::raw::c_uint;
pub const L_TEXT_ORIENT_UNKNOWN: _bindgen_ty_64 = 0;
pub const L_TEXT_ORIENT_UP: _bindgen_ty_64 = 1;
pub const L_TEXT_ORIENT_LEFT: _bindgen_ty_64 = 2;
pub const L_TEXT_ORIENT_DOWN: _bindgen_ty_64 = 3;
pub const L_TEXT_ORIENT_RIGHT: _bindgen_ty_64 = 4;
pub type _bindgen_ty_64 = ::std::os::raw::c_uint;
pub const L_HORIZONTAL_EDGES: _bindgen_ty_65 = 0;
pub const L_VERTICAL_EDGES: _bindgen_ty_65 = 1;
pub const L_ALL_EDGES: _bindgen_ty_65 = 2;
pub type _bindgen_ty_65 = ::std::os::raw::c_uint;
pub const L_HORIZONTAL_LINE: _bindgen_ty_66 = 0;
pub const L_POS_SLOPE_LINE: _bindgen_ty_66 = 1;
pub const L_VERTICAL_LINE: _bindgen_ty_66 = 2;
pub const L_NEG_SLOPE_LINE: _bindgen_ty_66 = 3;
pub const L_OBLIQUE_LINE: _bindgen_ty_66 = 4;
pub type _bindgen_ty_66 = ::std::os::raw::c_uint;
pub const L_PORTRAIT_MODE: _bindgen_ty_67 = 0;
pub const L_LANDSCAPE_MODE: _bindgen_ty_67 = 1;
pub type _bindgen_ty_67 = ::std::os::raw::c_uint;
pub const L_FROM_LEFT: _bindgen_ty_68 = 0;
pub const L_FROM_RIGHT: _bindgen_ty_68 = 1;
pub const L_FROM_TOP: _bindgen_ty_68 = 2;
pub const L_FROM_BOT: _bindgen_ty_68 = 3;
pub const L_SCAN_NEGATIVE: _bindgen_ty_68 = 4;
pub const L_SCAN_POSITIVE: _bindgen_ty_68 = 5;
pub const L_SCAN_BOTH: _bindgen_ty_68 = 6;
pub const L_SCAN_HORIZONTAL: _bindgen_ty_68 = 7;
pub const L_SCAN_VERTICAL: _bindgen_ty_68 = 8;
pub type _bindgen_ty_68 = ::std::os::raw::c_uint;
pub const L_ADJUST_SKIP: _bindgen_ty_69 = 0;
pub const L_ADJUST_LEFT: _bindgen_ty_69 = 1;
pub const L_ADJUST_RIGHT: _bindgen_ty_69 = 2;
pub const L_ADJUST_LEFT_AND_RIGHT: _bindgen_ty_69 = 3;
pub const L_ADJUST_TOP: _bindgen_ty_69 = 4;
pub const L_ADJUST_BOT: _bindgen_ty_69 = 5;
pub const L_ADJUST_TOP_AND_BOT: _bindgen_ty_69 = 6;
pub const L_ADJUST_CHOOSE_MIN: _bindgen_ty_69 = 7;
pub const L_ADJUST_CHOOSE_MAX: _bindgen_ty_69 = 8;
pub const L_SET_LEFT: _bindgen_ty_69 = 9;
pub const L_SET_RIGHT: _bindgen_ty_69 = 10;
pub const L_SET_TOP: _bindgen_ty_69 = 11;
pub const L_SET_BOT: _bindgen_ty_69 = 12;
pub const L_GET_LEFT: _bindgen_ty_69 = 13;
pub const L_GET_RIGHT: _bindgen_ty_69 = 14;
pub const L_GET_TOP: _bindgen_ty_69 = 15;
pub const L_GET_BOT: _bindgen_ty_69 = 16;
pub type _bindgen_ty_69 = ::std::os::raw::c_uint;
pub const L_USE_MINSIZE: _bindgen_ty_70 = 1;
pub const L_USE_MAXSIZE: _bindgen_ty_70 = 2;
pub const L_SUB_ON_LOC_DIFF: _bindgen_ty_70 = 3;
pub const L_SUB_ON_SIZE_DIFF: _bindgen_ty_70 = 4;
pub const L_USE_CAPPED_MIN: _bindgen_ty_70 = 5;
pub const L_USE_CAPPED_MAX: _bindgen_ty_70 = 6;
pub type _bindgen_ty_70 = ::std::os::raw::c_uint;
pub const L_COMBINE: _bindgen_ty_71 = 1;
pub const L_REMOVE_SMALL: _bindgen_ty_71 = 2;
pub type _bindgen_ty_71 = ::std::os::raw::c_uint;
pub const L_GEOMETRIC_UNION: _bindgen_ty_72 = 1;
pub const L_GEOMETRIC_INTERSECTION: _bindgen_ty_72 = 2;
pub const L_LARGEST_AREA: _bindgen_ty_72 = 3;
pub const L_SMALLEST_AREA: _bindgen_ty_72 = 4;
pub type _bindgen_ty_72 = ::std::os::raw::c_uint;
pub const L_USE_ALL_BOXES: _bindgen_ty_73 = 1;
pub const L_USE_SAME_PARITY_BOXES: _bindgen_ty_73 = 2;
pub type _bindgen_ty_73 = ::std::os::raw::c_uint;
pub const L_UPPER_LEFT: _bindgen_ty_74 = 1;
pub const L_UPPER_RIGHT: _bindgen_ty_74 = 2;
pub const L_LOWER_LEFT: _bindgen_ty_74 = 3;
pub const L_LOWER_RIGHT: _bindgen_ty_74 = 4;
pub const L_BOX_CENTER: _bindgen_ty_74 = 5;
pub type _bindgen_ty_74 = ::std::os::raw::c_uint;
pub const L_WARP_TO_LEFT: _bindgen_ty_75 = 1;
pub const L_WARP_TO_RIGHT: _bindgen_ty_75 = 2;
pub type _bindgen_ty_75 = ::std::os::raw::c_uint;
pub const L_LINEAR_WARP: _bindgen_ty_76 = 1;
pub const L_QUADRATIC_WARP: _bindgen_ty_76 = 2;
pub type _bindgen_ty_76 = ::std::os::raw::c_uint;
pub const L_INTERPOLATED: _bindgen_ty_77 = 1;
pub const L_SAMPLED: _bindgen_ty_77 = 2;
pub type _bindgen_ty_77 = ::std::os::raw::c_uint;
pub const L_THIN_FG: _bindgen_ty_78 = 1;
pub const L_THIN_BG: _bindgen_ty_78 = 2;
pub type _bindgen_ty_78 = ::std::os::raw::c_uint;
pub const L_HORIZONTAL_RUNS: _bindgen_ty_79 = 0;
pub const L_VERTICAL_RUNS: _bindgen_ty_79 = 1;
pub type _bindgen_ty_79 = ::std::os::raw::c_uint;
pub const L_SOBEL_EDGE: _bindgen_ty_80 = 1;
pub const L_TWO_SIDED_EDGE: _bindgen_ty_80 = 2;
pub type _bindgen_ty_80 = ::std::os::raw::c_uint;
pub const L_SUBPIXEL_ORDER_RGB: _bindgen_ty_81 = 1;
pub const L_SUBPIXEL_ORDER_BGR: _bindgen_ty_81 = 2;
pub const L_SUBPIXEL_ORDER_VRGB: _bindgen_ty_81 = 3;
pub const L_SUBPIXEL_ORDER_VBGR: _bindgen_ty_81 = 4;
pub type _bindgen_ty_81 = ::std::os::raw::c_uint;
pub const L_HS_HISTO: _bindgen_ty_82 = 1;
pub const L_HV_HISTO: _bindgen_ty_82 = 2;
pub const L_SV_HISTO: _bindgen_ty_82 = 3;
pub type _bindgen_ty_82 = ::std::os::raw::c_uint;
pub const L_INCLUDE_REGION: _bindgen_ty_83 = 1;
pub const L_EXCLUDE_REGION: _bindgen_ty_83 = 2;
pub type _bindgen_ty_83 = ::std::os::raw::c_uint;
pub const L_ADD_ABOVE: _bindgen_ty_84 = 1;
pub const L_ADD_BELOW: _bindgen_ty_84 = 2;
pub const L_ADD_LEFT: _bindgen_ty_84 = 3;
pub const L_ADD_RIGHT: _bindgen_ty_84 = 4;
pub const L_ADD_AT_TOP: _bindgen_ty_84 = 5;
pub const L_ADD_AT_BOT: _bindgen_ty_84 = 6;
pub const L_ADD_AT_LEFT: _bindgen_ty_84 = 7;
pub const L_ADD_AT_RIGHT: _bindgen_ty_84 = 8;
pub type _bindgen_ty_84 = ::std::os::raw::c_uint;
pub const L_PLOT_AT_TOP: _bindgen_ty_85 = 1;
pub const L_PLOT_AT_MID_HORIZ: _bindgen_ty_85 = 2;
pub const L_PLOT_AT_BOT: _bindgen_ty_85 = 3;
pub const L_PLOT_AT_LEFT: _bindgen_ty_85 = 4;
pub const L_PLOT_AT_MID_VERT: _bindgen_ty_85 = 5;
pub const L_PLOT_AT_RIGHT: _bindgen_ty_85 = 6;
pub type _bindgen_ty_85 = ::std::os::raw::c_uint;
pub const L_USE_INNER: _bindgen_ty_86 = 1;
pub const L_USE_OUTER: _bindgen_ty_86 = 2;
pub type _bindgen_ty_86 = ::std::os::raw::c_uint;
pub const L_DISPLAY_WITH_XZGV: _bindgen_ty_87 = 1;
pub const L_DISPLAY_WITH_XLI: _bindgen_ty_87 = 2;
pub const L_DISPLAY_WITH_XV: _bindgen_ty_87 = 3;
pub const L_DISPLAY_WITH_IV: _bindgen_ty_87 = 4;
pub const L_DISPLAY_WITH_OPEN: _bindgen_ty_87 = 5;
pub type _bindgen_ty_87 = ::std::os::raw::c_uint;
pub const L_NO_CHROMA_SAMPLING_JPEG: _bindgen_ty_88 = 1;
pub type _bindgen_ty_88 = ::std::os::raw::c_uint;
pub const L_CLIP_TO_ZERO: _bindgen_ty_89 = 1;
pub const L_TAKE_ABSVAL: _bindgen_ty_89 = 2;
pub type _bindgen_ty_89 = ::std::os::raw::c_uint;
pub const L_LESS_THAN_ZERO: _bindgen_ty_90 = 1;
pub const L_EQUAL_TO_ZERO: _bindgen_ty_90 = 2;
pub const L_GREATER_THAN_ZERO: _bindgen_ty_90 = 3;
pub type _bindgen_ty_90 = ::std::os::raw::c_uint;
pub const L_ADD_TRAIL_SLASH: _bindgen_ty_91 = 1;
pub const L_REMOVE_TRAIL_SLASH: _bindgen_ty_91 = 2;
pub type _bindgen_ty_91 = ::std::os::raw::c_uint;
pub type alloc_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: size_t) -> *mut ::std::os::raw::c_void>;
pub type dealloc_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct L_Recog {
    pub scalew: l_int32,
    pub scaleh: l_int32,
    pub linew: l_int32,
    pub templ_use: l_int32,
    pub maxarraysize: l_int32,
    pub setsize: l_int32,
    pub threshold: l_int32,
    pub maxyshift: l_int32,
    pub charset_type: l_int32,
    pub charset_size: l_int32,
    pub min_nopad: l_int32,
    pub num_samples: l_int32,
    pub minwidth_u: l_int32,
    pub maxwidth_u: l_int32,
    pub minheight_u: l_int32,
    pub maxheight_u: l_int32,
    pub minwidth: l_int32,
    pub maxwidth: l_int32,
    pub ave_done: l_int32,
    pub train_done: l_int32,
    pub max_wh_ratio: l_float32,
    pub max_ht_ratio: l_float32,
    pub min_splitw: l_int32,
    pub max_splith: l_int32,
    pub sa_text: *mut Sarray,
    pub dna_tochar: *mut L_Dna,
    pub centtab: *mut l_int32,
    pub sumtab: *mut l_int32,
    pub pixaa_u: *mut Pixaa,
    pub ptaa_u: *mut Ptaa,
    pub naasum_u: *mut Numaa,
    pub pixaa: *mut Pixaa,
    pub ptaa: *mut Ptaa,
    pub naasum: *mut Numaa,
    pub pixa_u: *mut Pixa,
    pub pta_u: *mut Pta,
    pub nasum_u: *mut Numa,
    pub pixa: *mut Pixa,
    pub pta: *mut Pta,
    pub nasum: *mut Numa,
    pub pixa_tr: *mut Pixa,
    pub pixadb_ave: *mut Pixa,
    pub pixa_id: *mut Pixa,
    pub pixdb_ave: *mut Pix,
    pub pixdb_range: *mut Pix,
    pub pixadb_boot: *mut Pixa,
    pub pixadb_split: *mut Pixa,
    pub bmf: *mut L_Bmf,
    pub bmf_size: l_int32,
    pub did: *mut L_Rdid,
    pub rch: *mut L_Rch,
    pub rcha: *mut L_Rcha,
}
#[test]
fn bindgen_test_layout_L_Recog() {
    assert_eq!(
        ::std::mem::size_of::<L_Recog>(),
        320usize,
        concat!("Size of: ", stringify!(L_Recog))
    );
    assert_eq!(
        ::std::mem::align_of::<L_Recog>(),
        8usize,
        concat!("Alignment of ", stringify!(L_Recog))
    );
    fn test_field_scalew() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scalew) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(scalew)
            )
        );
    }
    test_field_scalew();
    fn test_field_scaleh() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).scaleh) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(scaleh)
            )
        );
    }
    test_field_scaleh();
    fn test_field_linew() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linew) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(linew)
            )
        );
    }
    test_field_linew();
    fn test_field_templ_use() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).templ_use) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(templ_use)
            )
        );
    }
    test_field_templ_use();
    fn test_field_maxarraysize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxarraysize) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(maxarraysize)
            )
        );
    }
    test_field_maxarraysize();
    fn test_field_setsize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).setsize) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(setsize)
            )
        );
    }
    test_field_setsize();
    fn test_field_threshold() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).threshold) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(threshold)
            )
        );
    }
    test_field_threshold();
    fn test_field_maxyshift() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxyshift) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(maxyshift)
            )
        );
    }
    test_field_maxyshift();
    fn test_field_charset_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).charset_type) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(charset_type)
            )
        );
    }
    test_field_charset_type();
    fn test_field_charset_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).charset_size) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(charset_size)
            )
        );
    }
    test_field_charset_size();
    fn test_field_min_nopad() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).min_nopad) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(min_nopad)
            )
        );
    }
    test_field_min_nopad();
    fn test_field_num_samples() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).num_samples) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(num_samples)
            )
        );
    }
    test_field_num_samples();
    fn test_field_minwidth_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minwidth_u) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(minwidth_u)
            )
        );
    }
    test_field_minwidth_u();
    fn test_field_maxwidth_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxwidth_u) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(maxwidth_u)
            )
        );
    }
    test_field_maxwidth_u();
    fn test_field_minheight_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minheight_u) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(minheight_u)
            )
        );
    }
    test_field_minheight_u();
    fn test_field_maxheight_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxheight_u) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(maxheight_u)
            )
        );
    }
    test_field_maxheight_u();
    fn test_field_minwidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minwidth) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(minwidth)
            )
        );
    }
    test_field_minwidth();
    fn test_field_maxwidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxwidth) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(maxwidth)
            )
        );
    }
    test_field_maxwidth();
    fn test_field_ave_done() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ave_done) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(ave_done)
            )
        );
    }
    test_field_ave_done();
    fn test_field_train_done() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).train_done) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(train_done)
            )
        );
    }
    test_field_train_done();
    fn test_field_max_wh_ratio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_wh_ratio) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(max_wh_ratio)
            )
        );
    }
    test_field_max_wh_ratio();
    fn test_field_max_ht_ratio() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_ht_ratio) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(max_ht_ratio)
            )
        );
    }
    test_field_max_ht_ratio();
    fn test_field_min_splitw() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).min_splitw) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(min_splitw)
            )
        );
    }
    test_field_min_splitw();
    fn test_field_max_splith() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_splith) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(max_splith)
            )
        );
    }
    test_field_max_splith();
    fn test_field_sa_text() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sa_text) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(sa_text)
            )
        );
    }
    test_field_sa_text();
    fn test_field_dna_tochar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dna_tochar) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(dna_tochar)
            )
        );
    }
    test_field_dna_tochar();
    fn test_field_centtab() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).centtab) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(centtab)
            )
        );
    }
    test_field_centtab();
    fn test_field_sumtab() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sumtab) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(sumtab)
            )
        );
    }
    test_field_sumtab();
    fn test_field_pixaa_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixaa_u) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(pixaa_u)
            )
        );
    }
    test_field_pixaa_u();
    fn test_field_ptaa_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptaa_u) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(ptaa_u)
            )
        );
    }
    test_field_ptaa_u();
    fn test_field_naasum_u() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).naasum_u) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(naasum_u)
            )
        );
    }
    test_field_naasum_u();
    fn test_field_pixaa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixaa) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(L_Recog),
                "::",
                stringify!(pixaa)
            )
        );
    }
    test_field_pixaa();
    fn test_field_ptaa() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<L_Recog>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ptaa) as usize - ptr as usize
            },
            160usize,
